{
  "specName": "css22-ch15",
  "extractedAt": "2026-02-06T08:54:13.761Z",
  "totalSections": 9,
  "coreSections": 9,
  "sections": {
    "fonts-intro": {
      "id": "fonts-intro",
      "heading": "15.1 Introduction",
      "content": "Setting font properties will be among the most common uses of style\nsheets. Unfortunately, there exists no well-defined and universally\naccepted taxonomy for classifying fonts, and terms that apply to one\nfont family may not be appropriate for others. E.g., 'italic' is\ncommonly used to label slanted text, but slanted text may also be\nlabeled as being Oblique, Slanted, Incline, Cursive or\nKursiv. Therefore it is not a simple problem to map typical\nfont selection properties to a specific font.",
      "rawLength": 526
    },
    "algorithm": {
      "id": "algorithm",
      "heading": "15.2 Font matching algorithm",
      "content": "Because there is no accepted, universal taxonomy of font\nproperties, matching of properties to font faces must be done\ncarefully. The properties are matched in a well-defined order to\ninsure that the results of this matching process are as consistent as\npossible across UAs (assuming that the same library of font faces is\npresented to each of them).\n\n- The User Agent makes (or accesses) a database of relevant CSS 2.2\nproperties of all the fonts of which the UA is aware.\nIf there are two fonts with exactly the same properties, the user\nagent selects one of them.\n\n- At a given element and for each character in that element, the UA\nassembles the font properties applicable to that element. Using the\ncomplete set of properties, the UA uses the 'font-family' property to\nchoose a tentative font family. The remaining properties are tested\nagainst the family according to the matching criteria described with\neach property. If there are matches for all the remaining properties,\nthen that is the matching font face for the given element or character.\n\n- If there is no matching font face within the 'font-family' being\nprocessed by step 2, and if there is a next alternative 'font-family'\nin the font set, then repeat step 2 with the next alternative\n'font-family'.\n\n- If there is a matching font face, but it does not contain a glyph\nfor the current character, and if there is a next alternative\n'font-family' in the font sets, then repeat step 2 with the next\nalternative 'font-family'.\n\n- If there is no font within the family selected in 2, then use a\n UA-dependent default 'font-family' and repeat step 2, using the best\n match that can be obtained within the default font. If a particular\n character cannot be displayed using this font, then the UA may use other\n means to determine a suitable font for that character. The UA should map\n each character for which it has no suitable font to a visible symbol\n chosen by the UA, preferably a \"missing character\" glyph from one of the\n font faces available to the UA.\n\n(The above algorithm can be optimized to avoid having to revisit\nthe CSS 2.2 properties for each character.)\n\nThe per-property matching rules from (2) above are as follows:\n\n- ['font-style'](fonts.html#propdef-font-style) is tried first. 'Italic'\nwill be satisfied if there is either a face in the UA's font database\nlabeled with the CSS keyword 'italic' (preferred) or 'oblique'.\nOtherwise the values must be matched exactly or font-style will fail.\n\n- ['font-variant'](fonts.html#propdef-font-variant) is tried next. 'Small-caps' matches (1) a\nfont labeled as 'small-caps', (2) a font in which the small caps are\nsynthesized, or (3) a font where all lowercase letters are replaced by\nupper case letters. A small-caps font may be synthesized by\nelectronically scaling uppercase letters from a normal font.\n'normal' matches a font's normal (non-small-caps) variant. A font cannot fail to have a normal variant. A font\n that is only available as small-caps shall be selectable as either a 'normal' face or a 'small-caps' face.\n\n- ['font-weight'](fonts.html#propdef-font-weight) is matched next, it will\nnever fail. (See 'font-weight' below.)\n\n- ['font-size'](fonts.html#propdef-font-size) must be matched within a\nUA-dependent margin of tolerance. (Typically, sizes for scalable fonts\nare rounded to the nearest whole pixel, while the tolerance for\nbitmapped fonts could be as large as 20%.) Further computations, e.g.,\nby 'em' values in other properties, are based on\nthe computed value of 'font-size'.",
      "rawLength": 3935
    },
    "font-family-prop": {
      "id": "font-family-prop",
      "heading": "15.3 Font family: the 'font-family' property",
      "content": "Name:\n **font-family**Value:[[ [<family-name>](fonts.html#value-def-family-name) | [<generic-family>](fonts.html#value-def-generic-family) ] [, [ [<family-name>](fonts.html#value-def-family-name)| [<generic-family>](fonts.html#value-def-generic-family)] ]* ] | [inherit](cascade.html#value-def-inherit)\nInitial:depends on user agent\nApplies to:all elements\nInherited:yes\nPercentages:N/A\nMedia:[visual](media.html#visual-media-group)\nComputed value:as specified\n\nThe property value is a prioritized list of font family names\nand/or [generic family names.](#generic-font-families)\nUnlike most other CSS properties, component values are separated\nby a comma to indicate that they are alternatives:\n\n```\n\nbody { font-family: Gill, Helvetica, sans-serif }\n\n```\n\nAlthough many fonts provide the \"missing character\" glyph,\n typically an open box, as its name implies this should not be\n considered a match\n for characters that cannot be found in the font. (It should,\nhowever, be considered a match for U+FFFD, the \"missing character\"\ncharacter's code point).\n\nThere are two types of font family names:\n\n<family-name>\n\nThe name of a font family of choice. In the last example, \"Gill\"\nand \"Helvetica\" are font families.\n\n<generic-family>\n\nIn the example above, the last value is a generic family name. The\nfollowing generic families are defined:\n\n- 'serif' (e.g., Times)\n\n- 'sans-serif' (e.g., Helvetica)\n\n- 'cursive' (e.g., Zapf-Chancery)\n\n- 'fantasy' (e.g., Western)\n\n- 'monospace' (e.g., Courier)\n\nStyle sheet designers are encouraged to offer a generic font family\nas a last alternative. Generic font family names are keywords and must NOT be quoted.\n\nFont family names must either be given quoted as [strings,](syndata.html#strings) or unquoted as a sequence of\none or more [identifiers.](syndata.html#value-def-identifier) This means\nmost punctuation characters and digits at the start of each token must\nbe escaped in unquoted font family names.\n\nFor example, the following declarations are invalid:\n\n```\n\nfont-family: Red/Black, sans-serif;\nfont-family: \"Lucida\" Grande, sans-serif;\nfont-family: Ahem!, sans-serif;\nfont-family: test@foo, sans-serif;\nfont-family: #POUND, sans-serif;\nfont-family: Hawaii 5-0, sans-serif;\n\n```\n\nIf a sequence of identifiers is given as a font family name, the\ncomputed value is the name converted to a string by joining all the\nidentifiers in the sequence by single spaces.\n\nTo avoid mistakes in escaping, it is recommended to quote font\nfamily names that contain white space, digits, or punctuation\ncharacters other than hyphens:\n\n```\n\nbody { font-family: \"New Century Schoolbook\", serif }\n\n<BODY STYLE=\"font-family: '21st Century', fantasy\">\n\n```\n\nUnquoted font family names that happen to be the same as\nthe keyword values 'inherit', 'default' and 'initial' or the generic\nfont keywords ('serif', 'sans-serif', 'monospace', 'fantasy', and\n'cursive') do not match the '<family-name>' type. These names\nmust be quoted to prevent confusion with the keywords with the same\nnames. Note that 'font-family: Times, inherit' is therefore an invalid\ndeclaration, because 'inherit' in that position can neither be a valid\nkeyword nor a valid font family name.",
      "rawLength": 4138
    },
    "generic-font-families": {
      "id": "generic-font-families",
      "heading": "15.3.1 Generic font families",
      "content": "Generic font families are a fallback mechanism, a means of\npreserving some of the style sheet author's intent in the worst case\nwhen none of the specified fonts can be selected. For optimum\ntypographic control, particular named fonts should be used in\nstyle sheets.\n\nAll five generic font families are defined to exist in all\nCSS implementations (they need not necessarily map to five distinct\nactual fonts). User agents should provide reasonable\ndefault choices for the generic font families, which express the\ncharacteristics of each family as well as possible within the limits\nallowed by the underlying technology.\n\nUser agents are encouraged to allow users to select alternative\nchoices for the generic fonts.\n\n15.3.1.1 **serif**\n\nGlyphs of serif fonts, as the term is used in CSS, tend to have finishing\nstrokes, flared or tapering ends, or have actual serifed endings\n(including slab serifs). Serif fonts are typically\nproportionately-spaced. They often display a greater variation between\nthick and thin strokes than fonts from the 'sans-serif' generic font\nfamily. CSS uses the term 'serif' to apply to a font for any script,\nalthough other names may be more familiar for particular scripts, such\nas Mincho (Japanese), Sung or Song (Chinese), Totum or Kodig (Korean).\nAny font that is so described may be used to represent the\ngeneric 'serif' family.\n\nExamples of fonts that fit this description include:\n\nLatin fonts\n Times New Roman, Bodoni,\nGaramond, Minion Web, ITC Stone Serif, MS Georgia, Bitstream Cyberbit\nGreek fonts\n Bitstream Cyberbit\nCyrillic fonts\n Adobe Minion Cyrillic, Excelsior Cyrillic Upright,\nMonotype Albion 70, Bitstream Cyberbit, ER Bukinist\nHebrew fonts\n New Peninim, Raanana, Bitstream Cyberbit\nJapanese fonts\n Ryumin Light-KL, Kyokasho ICA, Futo Min A101\nArabic fonts\n Bitstream Cyberbit\nCherokee fonts\n Lo Cicero Cherokee\n\n15.3.1.2 \n**sans-serif**\n\nGlyphs in sans-serif fonts, as the term is used in CSS, tend to have stroke\nendings that are plain -- with little or no flaring, cross stroke, or other\nornamentation. Sans-serif fonts are typically\nproportionately-spaced. They often have little variation between thick\nand thin strokes, compared to fonts from the 'serif' family. CSS uses\nthe term 'sans-serif' to apply to a font for any script, although\nother names may be more familiar for particular scripts, such as\nGothic (Japanese), Kai (Chinese), or Pathang (Korean). Any font that\nis so described may be used to represent the generic 'sans-serif'\nfamily.\n\nExamples of fonts that fit this description include:\n\nLatin fonts\n MS Trebuchet, ITC Avant Garde Gothic, MS Arial, MS Verdana, Univers,\nFutura, ITC Stone Sans, Gill Sans, Akzidenz Grotesk, Helvetica\nGreek fonts\n Attika, Typiko New Era, MS Tahoma, Monotype Gill Sans 571, Helvetica Greek\nCyrillic fonts\n Helvetica Cyrillic, ER Univers, Lucida Sans Unicode, Bastion\nHebrew fonts\n Arial Hebrew, MS Tahoma\nJapanese fonts\n Shin Go, Heisei Kaku Gothic W5\nArabic fonts\n MS Tahoma\n\n15.3.1.3 \n**cursive**\n\nGlyphs in cursive fonts, as the term is used in CSS, generally have\neither joining strokes or other cursive characteristics beyond those\nof italic typefaces. The glyphs are partially or completely\nconnected, and the result looks more like handwritten pen or brush\nwriting than printed letterwork. Fonts for some scripts, such as\nArabic, are almost always cursive. CSS uses the term 'cursive' to\napply to a font for any script, although other names such as Chancery,\nBrush, Swing and Script are also used in font names.\n\nExamples of fonts that fit this description include:\n\nLatin fonts\n Caflisch Script, Adobe Poetica, Sanvito, Ex Ponto, Snell Roundhand,\nZapf-Chancery\nCyrillic fonts\n ER Architekt\nHebrew fonts\n Corsiva\nArabic fonts\n DecoType Naskh, Monotype Urdu 507\n\n15.3.1.4 \n**fantasy**\n\nFantasy fonts, as used in CSS, are primarily decorative while\nstill containing representations of characters (as opposed to Pi or\nPicture fonts, which do not represent characters). Examples include:\n\nLatin fonts\n Alpha Geometrique, Critter, Cottonwood, FB Reactor, Studz\n\n15.3.1.5 \n**monospace**\n\nThe sole criterion of a monospace font is that all glyphs have the same fixed width. (This can make some scripts,\nsuch as Arabic, look most peculiar.) The effect is similar to a manual\ntypewriter, and is often used to set samples of computer code.\n\nExamples of fonts which fit this description include:\n\nLatin fonts\n Courier, MS Courier New, Prestige, Everson Mono\nGreek Fonts\n MS Courier New, Everson Mono\nCyrillic fonts\n ER Kurier, Everson Mono\nJapanese fonts\n Osaka Monospaced\nCherokee fonts\n Everson Mono",
      "rawLength": 5595
    },
    "font-styling": {
      "id": "font-styling",
      "heading": "15.4 Font styling: the 'font-style' property",
      "content": "Name:\n **font-style**Value:normal | italic | oblique | [inherit](cascade.html#value-def-inherit)\nInitial:normal\nApplies to:all elements\nInherited:yes\nPercentages:N/A\nMedia:[visual](media.html#visual-media-group)\nComputed value:as specified\n\nThe 'font-style' property selects between normal (sometimes\nreferred to as \"roman\" or \"upright\"), italic and oblique faces within\na font family.\n\nA value of 'normal' selects a font that is classified as 'normal'\nin the UA's font database, while 'oblique' selects a font that is\nlabeled 'oblique'. A value of 'italic' selects a font that is labeled\n'italic', or, if that is not available, one labeled 'oblique'.\n\nThe font that is labeled 'oblique' in the UA's font database may\nactually have been generated by electronically slanting a normal font.\n\nFonts with Oblique, Slanted or Incline in their names will\ntypically be labeled 'oblique' in the UA's font database. Fonts with\nItalic, Cursive or Kursiv in their names will\ntypically be labeled 'italic'.\n\n```\n\nh1, h2, h3 { font-style: italic }\nh1 em { font-style: normal }\n\n```\n\nIn the example above, emphasized text within 'H1' will appear in a\nnormal face.",
      "rawLength": 1556
    },
    "small-caps": {
      "id": "small-caps",
      "heading": "15.5 Small-caps: the 'font-variant' property",
      "content": "Name:\n **font-variant**Value:normal | small-caps | [inherit](cascade.html#value-def-inherit)\nInitial:normal\nApplies to:all elements\nInherited:yes\nPercentages:N/A\nMedia:[visual](media.html#visual-media-group)\nComputed value:as specified\n\nAnother type of variation within a font family is the small-caps.\nIn a small-caps font the lower case letters look similar to the\nuppercase ones, but in a smaller size and with slightly different\nproportions. The 'font-variant' property selects that font.\n\nA value of 'normal' selects a font that is not a small-caps font,\n'small-caps' selects a small-caps font. It is acceptable (but not\nrequired) in CSS 2.2 if the small-caps font is a created by taking a\nnormal font and replacing the lower case letters by scaled uppercase\ncharacters. As a last resort, uppercase letters will be used as\nreplacement for a small-caps font.\n\nThe following example results in an 'H3' element in small-caps,\nwith any emphasized words in oblique, and any emphasized words within\nan 'H3' oblique small-caps:\n\n```\n\nh3 { font-variant: small-caps }\nem { font-style: oblique }\n\n```\n\nThere may be other variants in the font family as well, such as\nfonts with old-style numerals, small-caps numerals, condensed or\nexpanded letters, etc. CSS 2.2 has no properties that select those.\n\nNote: insofar as this property causes text to be\ntransformed to uppercase, the same considerations as for ['text-transform'](text.html#propdef-text-transform) apply.",
      "rawLength": 1943
    },
    "font-boldness": {
      "id": "font-boldness",
      "heading": "15.6 Font boldness: the 'font-weight' property",
      "content": "Name:\n **font-weight**Value:normal | bold | bolder | lighter | 100 | 200 | 300 | 400 | 500 |\n600 | 700 | 800 | 900 | [inherit](cascade.html#value-def-inherit)\nInitial:normal\nApplies to:all elements\nInherited:yes\nPercentages:N/A\nMedia:[visual](media.html#visual-media-group)\nComputed value:see text\n\nThe 'font-weight' property selects the weight of the font. The\nvalues '100' to '900' form an ordered sequence, where each number\nindicates a weight that is at least as dark as its predecessor. The\nkeyword 'normal' is synonymous with '400', and 'bold' is synonymous\nwith '700'. Keywords other than 'normal' and 'bold' have been shown to\nbe often confused with font names and a numerical scale was therefore\nchosen for the 9-value list.\n\n```\n\np { font-weight: normal } /* 400 */\nh1 { font-weight: 700 } /* bold */\n\n```\n\nThe 'bolder' and 'lighter' values select font weights that are\nrelative to the weight inherited from the parent:\n\n```\n\nstrong { font-weight: bolder }\n\n```\n\nFonts (the font data) typically have one or more properties whose\nvalues are names that are descriptive of the \"weight\" of a font. There\nis no accepted, universal meaning to these weight names. Their primary\nrole is to distinguish faces of differing darkness within a single\nfont family. Usage across font families is quite variant; for example,\na font that one might think of as being bold might be described as\nbeing Regular, Roman, Book, Medium, Semi- or DemiBold,\nBold, or Black, depending on how black the \"normal\" face\nof the font is within the design. Because there is no standard usage\nof names, the weight property values in CSS 2.2 are given on a numerical\nscale in which the value '400' (or 'normal') corresponds to the\n\"normal\" text face for that family. The weight name associated with\nthat face will typically be Book, Regular, Roman, Normal or\nsometimes Medium.\n\nThe association of other weights within a family to the numerical\nweight values is intended only to preserve the ordering of darkness\nwithin that family. However, the following heuristics tell how the\nassignment is done in this case:\n\nIf the font family already uses a numerical scale with nine values\n(like e.g., OpenType does), the font weights should be mapped\ndirectly.\n\nIf there is both a face labeled Medium and one labeled\nBook, Regular, Roman or Normal, then the\nMedium is normally assigned to the '500'.\n\nThe font labeled \"Bold\" will often correspond to the weight value '700'.\n\nOnce the font family's weights are mapped onto the CSS scale,\nmissing weights are selected as follows:\n\nIf the desired weight is less than 400, weights below the desired\nweight are checked in descending order followed by weights above the\ndesired weight in ascending order until a match is found.\n\nIf the desired weight is greater than 500, weights above desired\nweight are checked in ascending order followed by weights below the\ndesired weight in descending order until a match is found.\n\nIf the desired weight is 400, 500 is checked first and then the\nrule for desired weights less than 400 is used.\n\nIf the desired weight is 500, 400 is checked first and then the\nrule for desired weights less than 400 is used.\n\nThe following two examples show typical mappings.\n\nAssume four weights in the \"Rattlesnake\" family, from lightest to\ndarkest: Regular, Medium, Bold, Heavy.\n\nFirst example of font-weight mapping\n\nAvailable faces Assignments Filling the holes\n\n\"Rattlesnake Regular\" 400 100, 200, 300\n\"Rattlesnake Medium\" 500 \n\"Rattlesnake Bold\" 700 600\n\"Rattlesnake Heavy\" 800 900\n\nAssume six weights in the\n\"Ice Prawn\" family: Book, Medium, Bold, Heavy, Black,\nExtraBlack. Note that in this instance the user agent\nhas decided not to assign a numeric\nvalue to \"Ice Prawn ExtraBlack\".\n\nSecond example of font-weight mapping\n\nAvailable faces Assignments Filling the holes\n\n\"Ice Prawn Book\" 400 100, 200, 300\n\"Ice Prawn Medium\" 500 \n\"Ice Prawn Bold\" 700 600\n\"Ice Prawn Heavy\" 800 \n\"Ice Prawn Black\" 900 \n\"Ice Prawn ExtraBlack\" (none) \n\nValues of 'bolder' and 'lighter' indicate values relative to the\nweight of the parent element. Based on the inherited weight value,\nthe weight used is calculated using the chart below. Child elements\ninherit the calculated weight, not a value of 'bolder' or 'lighter'.\n\nThe meaning of 'bolder' and 'lighter'\n\nInherited value bolder lighter\n\n100 400 100\n200 400 100\n300 400 100\n400 700 100\n500 700 100\n600 900 400\n700 900 400\n800 900 700\n900 900 700\n\nThe table above is equivalent to selecting the next relative bolder\nor lighter face, given a font family containing normal and bold faces\nalong with a thin and a heavy face. Authors who desire finer control\nover the exact weight values used for a given element should use\nnumerical values instead of relative weights.\n\nThere is no guarantee that there will be a darker face for each of\nthe 'font-weight' values; for example, some fonts may have only a\nnormal and a bold face, while others may have eight face weights.\nThere is no guarantee on how a UA will map font faces within a family\nto weight values. The only guarantee is that a face of a given value\nwill be no less dark than the faces of lighter values.",
      "rawLength": 7097
    },
    "font-size-props": {
      "id": "font-size-props",
      "heading": "15.7 Font size: the 'font-size' property",
      "content": "Name:\n **font-size**Value:[<absolute-size>](fonts.html#value-def-absolute-size) | [<relative-size>](fonts.html#value-def-relative-size) | [<length>](syndata.html#value-def-length) | [<percentage>](syndata.html#value-def-percentage) | [inherit](cascade.html#value-def-inherit)\nInitial:medium\nApplies to:all elements\nInherited:yes\nPercentages:refer to inherited font size\nMedia:[visual](media.html#visual-media-group)\nComputed value:absolute length\n\nThe font size corresponds to the em square, a concept used in typography.\nNote that certain glyphs may bleed outside their em squares. Values\nhave the following meanings:\n\n<absolute-size>\n\nAn <absolute-size> keyword is an index to a table of font\nsizes computed and kept by the UA. Possible values are:\n\n [ xx-small | x-small | small | medium | large | x-large | xx-large ]\n\nThe following table provides user agent guidelines for the absolute-size\n mapping to HTML heading and absolute font-sizes. The 'medium' value is\n the user's preferred font size and is used as the reference middle value.\n\n \n CSS absolute-size values\n xx-small\n x-small\n small\n medium\n large\n x-large\n xx-large\n \n \n \n HTML font sizes\n 1\n \n 2\n 3\n 4\n 5\n 6\n 7\n \n\nImplementors should build a table of scaling factors for absolute-size keywords relative to the 'medium' font size and the particular device and its characteristics (e.g., the resolution of the device).\n\nDifferent media may need different scaling factors. Also, the UA\nshould take the quality and availability of fonts into account when\ncomputing the table. The table may be different from one font family\nto another.\n\nNote 1. To preserve readability, a UA applying\nthese guidelines should nevertheless avoid creating font-size resulting\n in less than 9 pixels per EM unit on a computer display.\n\nNote 2. In CSS1, the suggested\nscaling factor between adjacent indexes was 1.5, which user experience\nproved to be too large. In CSS2, the suggested scaling factor for a\ncomputer screen between adjacent indexes was 1.2, which still created\nissues for the small sizes. Implementation experience has demonstrated\nthat a fixed ratio between adjacent absolute-size keywords is\nproblematic, and this specification does not recommend such a\nfixed ratio.\n\n<relative-size>\n\nA <relative-size> keyword is interpreted relative to the\ntable of font sizes and the font size of the parent element. Possible\nvalues are: [ larger | smaller ]. For example, if the parent element\nhas a font size of 'medium', a value of 'larger' will make the font\nsize of the current element be 'large'. If the parent element's size\nis not close to a table entry, the UA is free to interpolate between\ntable entries or round off to the closest one. The UA may have to\nextrapolate table values if the numerical value goes beyond the\nkeywords.\n\nLength and percentage values should not take the font size table\ninto account when calculating the font size of the element.\n\nNegative values are not allowed.\n\nOn all other properties, 'em' and 'ex' length values refer to the\ncomputed font size of the current element. On the 'font-size' property, these\nlength units refer to the computed font size of the parent element.\n\nNote that an application may reinterpret an explicit size,\ndepending on the context. E.g., inside a VR scene a font may get a\ndifferent size because of perspective distortion.\n\nExamples:\n\n```\n\np { font-size: 16px; }\n@media print {\n p { font-size: 12pt; }\n}\nblockquote { font-size: larger }\nem { font-size: 150% }\nem { font-size: 1.5em }\n\n```",
      "rawLength": 4991
    },
    "font-shorthand": {
      "id": "font-shorthand",
      "heading": "15.8 Shorthand font property: the 'font' property",
      "content": "Name:\n **font**Value:[ [ [<'font-style'>](fonts.html#propdef-font-style) || [<'font-variant'>](fonts.html#propdef-font-variant) || [<'font-weight'>](fonts.html#propdef-font-weight) ]?\n[<'font-size'>](fonts.html#propdef-font-size) [ / [<'line-height'>](visudet.html#propdef-line-height) ]? [<'font-family'>](fonts.html#propdef-font-family) ] | caption | icon | menu | message-box | small-caption | status-bar | [inherit](cascade.html#value-def-inherit)\nInitial:see individual properties\nApplies to:all elements\nInherited:yes\nPercentages:see individual properties\nMedia:[visual](media.html#visual-media-group)\nComputed value:see individual properties\n\nThe ['font'](fonts.html#propdef-font) property is,\nexcept as described [below](#almost), a shorthand property for\nsetting\n['font-style'](fonts.html#propdef-font-style),\n['font-variant'](fonts.html#propdef-font-variant),\n['font-weight'](fonts.html#propdef-font-weight),\n['font-size'](fonts.html#propdef-font-size),\n['line-height'](visudet.html#propdef-line-height) and\n['font-family'](fonts.html#propdef-font-family) at the same\nplace in the style\nsheet. The syntax of this property is based on a traditional\ntypographical shorthand notation to set multiple properties related to\nfonts.\n\nAll font-related properties are first reset to their initial values,\nincluding those listed in the preceding paragraph.\nThen, those properties that are given explicit values in the\n['font'](fonts.html#propdef-font) shorthand are set to those values.\nFor a definition of allowed and initial values, see the previously defined properties.\n\n```\n\np { font: 12px/14px sans-serif }\np { font: 80% sans-serif }\np { font: x-large/110% \"New Century Schoolbook\", serif }\np { font: bold italic large Palatino, serif }\np { font: normal small-caps 120%/120% fantasy }\n\n```\n\nIn the second rule, the font size percentage value ('80%') refers\nto the font size of the parent element. In the third rule, the line\nheight percentage refers to the font size of the element itself.\n\nIn the first three rules above, the 'font-style', 'font-variant'\nand 'font-weight' are not explicitly mentioned, which means they are\nall three set to their initial value ('normal'). The fourth rule sets\nthe 'font-weight' to 'bold', the 'font-style' to 'italic' and\nimplicitly sets 'font-variant' to 'normal'.\n\nThe fifth rule sets the 'font-variant' ('small-caps'), the\n'font-size' (120% of the parent's font), the 'line-height' (120% times\nthe font size) and the 'font-family' ('fantasy'). It follows that the\nkeyword 'normal' applies to the two remaining properties: 'font-style'\nand 'font-weight'.\n\nThe following values refer to system fonts:\n\ncaption\nThe font used for captioned controls (e.g., buttons, drop-downs, etc.).\nicon\nThe font used to label icons.\nmenu\nThe font used in menus (e.g., dropdown menus and menu lists).\nmessage-box\nThe font used in dialog boxes.\nsmall-caption\nThe font used for labeling small controls.\nstatus-bar\nThe font used in window status bars.\n\nSystem fonts may only be set as a whole; that is, the font\nfamily, size, weight, style, etc. are all set at the same time.\nThese values may then be altered individually if desired. If no\nfont with the indicated characteristics exists on a given platform,\nthe user agent should either intelligently substitute (e.g., a smaller\nversion of the 'caption' font might be used for the 'small-caption'\nfont), or substitute a user agent default font. As for regular fonts,\nif, for a system font, any of the individual properties are not part\nof the operating system's available user preferences, those properties\nshould be set to their initial values.\n\nThat is why this property is \"almost\" a shorthand property: system\nfonts can only be specified with this property, not with ['font-family'](fonts.html#propdef-font-family) itself, so ['font'](fonts.html#propdef-font) allows authors to do more than the\nsum of its subproperties. However, the individual properties such as ['font-weight'](fonts.html#propdef-font-weight) are still given values taken from the system font, which can be independently varied.\n\nExample(s):\n\n```\n\nbutton { font: 300 italic 1.3em/1.7em \"FB Armada\", sans-serif }\nbutton p { font: menu }\nbutton p em { font-weight: bolder }\n\n```\n\nIf the font used for dropdown menus on a particular system\nhappened to be, for example, 9-point Charcoal, with a weight of 600, then P\nelements that were descendants of BUTTON would be displayed as if\nthis rule were in effect:\n\n```\n\nbutton p { font: 600 9px Charcoal }\n\n```\n\nBecause the ['font'](fonts.html#propdef-font) shorthand\nproperty resets any property not explicitly given a value\nto its initial value, this has the same effect as this declaration:\n\n```\n\nbutton p {\n font-family: Charcoal;\n font-style: normal;\n font-variant: normal;\n font-weight: 600;\n font-size: 9px;\n line-height: normal;\n}\n\n```\n\n[previous](colors.html) \n[next](text.html) \n[contents](Overview.html#minitoc) \n[properties](propidx.html) \n[index](indexlist.html)",
      "rawLength": 7024
    }
  }
}