{
  "specName": "css22-ch6",
  "extractedAt": "2026-02-06T08:54:13.744Z",
  "totalSections": 13,
  "coreSections": 13,
  "sections": {
    "value-stages": {
      "id": "value-stages",
      "heading": "6.1 Specified, computed, and actual values",
      "content": "Once a user agent has parsed a document and constructed a [document tree](conform.html#doctree), it must assign, for\nevery element in the tree, a value to every property that applies to the\ntarget [media type](media.html). \n\nThe final value of a property is the result of a four-step\ncalculation: the value is determined through specification (the\n\"specified value\"), then resolved into a value that is used for\ninheritance (the \"computed value\"), then converted into an absolute\nvalue if necessary (the \"used value\"), and finally transformed\naccording to the limitations of the local environment (the \"actual\nvalue\").",
      "rawLength": 650
    },
    "specified-value": {
      "id": "specified-value",
      "heading": "6.1.1 Specified values",
      "content": "User agents must first assign a specified value to each property based\non the following mechanisms (in order of precedence):\n\nIf the [cascade](#cascade) results in a value, use it.\nExcept that, if the value is 'inherit', the specified value is defined\nin [“The 'inherit' value”](#value-def-inherit) below.\n\nOtherwise, if the property is [inherited](#inheritance) and the element is not the root of the document tree, use the computed value of the parent element.\nOtherwise use the property's initial value. The initial value of each property is indicated in the property's definition.",
      "rawLength": 743
    },
    "computed-value": {
      "id": "computed-value",
      "heading": "6.1.2 Computed values",
      "content": "Specified values are resolved to computed values during the cascade;\nfor example URIs are made absolute and 'em' and 'ex'\nunits are computed to pixel or absolute lengths. Computing a value\nnever requires the user agent to render the document.\n\nThe computed value of URIs that the UA cannot resolve to absolute\nURIs is the specified value.\n\nThe computed value of a\nproperty is determined as specified by the Computed Value line in the\ndefinition of the\nproperty. See the section on [inheritance](#inheritance)\nfor the definition of computed values when the specified value is\n'inherit'.\n\nThe computed value exists even when the property does not apply, as\ndefined by the ['Applies To'](about.html#applies-to) line.\nHowever, some\nproperties may define the computed value of a property for an element\nto depend on whether the property applies to that element.",
      "rawLength": 895
    },
    "used-value": {
      "id": "used-value",
      "heading": "6.1.3 Used values",
      "content": "Computed values are processed as far as possible without formatting\nthe document. Some values, however, can only be determined when the\ndocument is being laid out. For example, if the width of an element is\nset to be a certain percentage of its containing block, the width\ncannot be determined until the width of the containing block has been\ndetermined. The **used value** is the result of\ntaking the computed value and resolving any remaining dependencies\ninto an absolute value.",
      "rawLength": 510
    },
    "actual-value": {
      "id": "actual-value",
      "heading": "6.1.4 Actual values",
      "content": "A used value is in principle the value used for rendering, but a\nuser agent may not be able to make use of the value in a given\nenvironment. For example, a user agent may only be able to render\nborders with integer pixel widths and may therefore have to\napproximate the computed width, or the user agent may be forced to\nuse only black and white shades instead of full color. The actual\nvalue is the used value after any approximations have been applied.",
      "rawLength": 462
    },
    "inheritance": {
      "id": "inheritance",
      "heading": "6.2 Inheritance",
      "content": "Some values are inherited by the children of an element in the [document tree](conform.html#doctree), as described [above](#specified-value). Each property [defines](about.html#property-defs) whether it is inherited or\nnot.\n\nSuppose there is an H1 element with an emphasizing element (EM)\ninside:\n\n```\n\n<H1>The headline <EM>is</EM> important!</H1>\n\n```\n\nIf no color has been assigned to the EM element, the emphasized\n\"is\" will inherit the color of the parent element, so if H1 has the\ncolor blue, the EM element will likewise be in blue.\n\nWhen inheritance occurs, elements inherit computed values. The\ncomputed value from the parent element becomes both the specified\nvalue and the computed value on the child.\n\nExample(s):\n\n \nFor example, given the following style sheet:\n\n```\n\nbody { font-size: 10pt }\nh1 { font-size: 130% }\n\n```\n\nand this document fragment:\n\n```\n\n<BODY>\n <H1>A <EM>large</EM> heading</H1>\n</BODY>\n\n```\n\nthe 'font-size' property\nfor the H1 element will have the computed value '13pt' (130% times\n10pt, the parent's value). Since the computed value of ['font-size'](fonts.html#propdef-font-size) is inherited, the EM\nelement will have the computed value '13pt' as well. If the\nuser agent does not have the 13pt font available, the\nactual value of ['font-size'](fonts.html#propdef-font-size)\nfor both H1 and EM might be, for example, '12pt'.\n\nNote that inheritance follows the document tree and is\nnot intercepted by [anonymous boxes.](visuren.html#box-gen)",
      "rawLength": 1939
    },
    "value-def-inherit": {
      "id": "value-def-inherit",
      "heading": "6.2.1 The 'inherit' value",
      "content": "Each property may also have a cascaded value of 'inherit', which\nmeans that, for a given element, the property takes as specified\nvalue the computed value of the element's parent. The 'inherit' value\ncan be used to enforce inheritance of values, and it can also be used on\nproperties that are not normally inherited.\n\nIf the 'inherit' value is set on the root element, the property is\nassigned its initial value.\n\nExample(s):\nIn the example below, the ['color'](colors.html#propdef-color) and ['background'](colors.html#propdef-background) properties are set on\nthe BODY element. On all other elements, the 'color' value will be\ninherited and the background will be transparent. If these rules are\npart of the user's style sheet, black text on a white background will\nbe enforced throughout the document.\n\n```\n\nbody {\n color: black !important; \n background: white !important;\n}\n\n* { \n color: inherit !important; \n background: transparent !important;\n}\n\n```",
      "rawLength": 1164
    },
    "at-import": {
      "id": "at-import",
      "heading": "6.3 The @import rule",
      "content": "The **'@import'** rule allows users to\nimport style rules from other style sheets. In CSS 2.2, any\n@import rules must precede all other rules (except the @charset rule,\nif present). See the [section on\nparsing](syndata.html#at-rules) for when user agents must ignore @import rules. The\n'@import' keyword must be followed by the URI of the style sheet to\ninclude. A string is also allowed; it will be interpreted as if it had\nurl(...) around it.\n\nExample(s):\n\n \nThe following lines are equivalent in meaning and illustrate both\n'@import' syntaxes (one with \"url()\" and one with a bare string):\n\n```\n\n@import \"mystyle.css\";\n@import url(\"mystyle.css\");\n\n```\n\nSo that user agents can avoid retrieving resources for unsupported\n[media types](media.html), authors may specify\nmedia-dependent @import rules. These conditional\nimports specify comma-separated media types after the URI.\n\nExample(s):\n\nThe following rules illustrate how @import rules can be made media-dependent:\n\n```\n\n@import url(\"fineprint.css\") print;\n@import url(\"bluish.css\") projection, tv;\n\n```\n\nIn the absence of any media types, the import is\nunconditional. Specifying 'all' for the medium has the same effect.\nThe import only takes effect if the target medium matches the media\nlist.\n\nA target medium matches a media list if one of the items in the\nmedia list is the target medium or 'all'.\n\nNote that Media Queries [[MEDIAQ]](refs.html#ref-MEDIAQ) extends the syntax of\nmedia lists and the definition of matching.\n\nWhen the same style sheet is imported or linked to a document in\nmultiple places, user agents must process (or act as though they do)\neach link as though the link were to a separate style sheet.",
      "rawLength": 2176
    },
    "cascade": {
      "id": "cascade",
      "heading": "6.4 The cascade",
      "content": "Style sheets may have three different origins: author, user, and\nuser agent.\n\nAuthor. The author specifies style sheets\nfor a source document according to the conventions of the document\nlanguage. For instance, in HTML, style sheets may be included in the\ndocument or linked externally.\n\nUser: The user may be able to specify style\ninformation for a particular document. For example, the user may\nspecify a file that contains a style sheet or the user agent may\nprovide an interface that generates a user style sheet (or behaves as\nif it did).\n\nUser agent: [Conforming user agents](conform.html#conformance) must apply\na **default style sheet**\n(or behave as if they did). A user agent's default style sheet should\npresent the\nelements of the document language in ways that satisfy general\npresentation expectations for the document language (e.g., for visual\nbrowsers, the EM element in HTML is presented using an italic\nfont). See [A sample style sheet for HTML\n](sample.html) for a recommended default style sheet for HTML documents.\n\nNote that the user may modify system settings (e.g., \nsystem colors) that affect the default style sheet. However, some user \nagent implementations make it impossible to change the values in the \ndefault style sheet.\n\nStyle sheets from these three origins will overlap in scope, and\nthey interact according to the cascade.\n\nThe CSS cascade\nassigns a weight to each style rule. When several rules apply, the one\nwith the greatest weight takes precedence.\n\nBy default, rules in author style sheets have more weight than\nrules in user style sheets. Precedence is reversed, however, for\n\"!important\" rules. All user and author rules have more weight\nthan rules in the UA's default style sheet.",
      "rawLength": 2025
    },
    "cascading-order": {
      "id": "cascading-order",
      "heading": "6.4.1 Cascading order",
      "content": "To find the value for an element/property combination, user agents\nmust apply the following sorting order:\n\n \n Find all declarations that apply to the element and property in\n question, for the target [media type](media.html).\n Declarations apply if the associated selector [matches](selector.html) the element in question and the\n target medium matches the media list on all @media rules\n containing the declaration and on all links on the path through\n which the style sheet was reached.\n\n Sort according to importance (normal or important)\nand origin (author, user, or user agent). In ascending order of\nprecedence:\n\nuser agent declarations\nuser normal declarations\nauthor normal declarations\nauthor important declarations\nuser important declarations\n\n \n Sort rules with the same importance and origin by [specificity](#specificity) \n of selector: more specific\n selectors will override more general ones. Pseudo-elements and\n pseudo-classes are counted as normal elements and classes,\n respectively.\n\n Finally, sort by order specified: if two declarations have the\n same weight, origin and specificity, the latter specified wins.\n Declarations in imported style sheets are considered to be before any\n declarations in the style sheet itself.\n\nApart from the \"!important\" setting on individual declarations,\nthis strategy gives author's style sheets higher weight than those of\nthe reader. User agents must give the user the ability to turn off the\ninfluence of specific author style sheets, e.g., through a pull-down\nmenu. Conformance to UAAG 1.0 checkpoint 4.14 satisfies this condition [[UAAG10]](refs.html#ref-UAAG10).",
      "rawLength": 1888
    },
    "important-rules": {
      "id": "important-rules",
      "heading": "6.4.2 !important rules",
      "content": "CSS attempts to create a balance of power between author\nand user style sheets. By default, rules in an author's style\nsheet override those in a user's style sheet (see cascade\nrule 3). \n\nHowever, for balance, an \"!important\" declaration (the delimiter token \n\"!\" and keyword \"important\" follow the declaration) takes precedence over \na normal declaration. Both author and user style sheets may contain\n\"!important\" declarations, and user \"!important\" rules override author\n\"!important\" rules. This CSS feature improves accessibility\nof documents by giving users with special requirements (large\nfonts, color combinations, etc.) control over presentation.\n\nDeclaring a shorthand property (e.g., ['background'](colors.html#propdef-background)) to be \"!important\" is\nequivalent to declaring all of its sub-properties to be \"!important\".\n\nExample(s):\n \nThe first rule in the user's style sheet in the following example\ncontains an \"!important\" declaration, which overrides the corresponding\ndeclaration in the author's style sheet. The second declaration\nwill also win due to being marked \"!important\". However, the third\nrule in the user's style sheet is not \"!important\" and will therefore\nlose to the second rule in the author's style sheet (which happens to\nset style on a shorthand property). Also, the third author rule will\nlose to the second author rule since the second rule is\n\"!important\". This shows that \"!important\" declarations have a\nfunction also within author style sheets.\n\n```\n\n/* From the user's style sheet */\np { text-indent: 1em ! important }\np { font-style: italic ! important }\np { font-size: 18pt }\n\n/* From the author's style sheet */\np { text-indent: 1.5em !important }\np { font: normal 12pt sans-serif !important }\np { font-size: 24pt }\n\n```",
      "rawLength": 1989
    },
    "specificity": {
      "id": "specificity",
      "heading": "6.4.3 Calculating a selector's specificity",
      "content": "A selector's specificity is calculated as follows:\n\ncount 1 if the declaration is from is a 'style' attribute rather\nthan a rule with a\nselector, 0 otherwise (= a) (In HTML, values of an element's \"style\"\nattribute are style sheet rules. These rules have no selectors, so\na=1, b=0, c=0, and d=0.)\n\ncount the number of ID attributes in the selector (= b)\n\ncount the number of other attributes and pseudo-classes \nin the selector (= c)\n\ncount the number of element names and pseudo-elements in the selector (= d)\n\nThe specificity is based only on the form of the selector. In\nparticular, a selector of the form \"[id=p33]\" is counted as an\nattribute selector (a=0, b=0, c=1, d=0), even if the id attribute is\ndefined as an \"ID\" in the source document's DTD.\n\nConcatenating the four numbers a-b-c-d (in a number system with a large\nbase) gives the specificity. \n\nExample(s):\n\nSome examples:\n\n```\n\n * {} /* a=0 b=0 c=0 d=0 -> specificity = 0,0,0,0 */\n li {} /* a=0 b=0 c=0 d=1 -> specificity = 0,0,0,1 */\n li:first-line {} /* a=0 b=0 c=0 d=2 -> specificity = 0,0,0,2 */\n ul li {} /* a=0 b=0 c=0 d=2 -> specificity = 0,0,0,2 */\n ul ol+li {} /* a=0 b=0 c=0 d=3 -> specificity = 0,0,0,3 */\n h1 + *[rel=up]{} /* a=0 b=0 c=1 d=1 -> specificity = 0,0,1,1 */\n ul ol li.red {} /* a=0 b=0 c=1 d=3 -> specificity = 0,0,1,3 */\n li.red.level {} /* a=0 b=0 c=2 d=1 -> specificity = 0,0,2,1 */\n #x34y {} /* a=0 b=1 c=0 d=0 -> specificity = 0,1,0,0 */\n style=\"\" /* a=1 b=0 c=0 d=0 -> specificity = 1,0,0,0 */\n\n```\n\n```\n\n<HEAD>\n<STYLE type=\"text/css\">\n #x97z { color: red }\n</STYLE>\n</HEAD>\n<BODY>\n<P ID=x97z style=\"color: green\">\n</BODY>\n\n```\n\nIn the above example, the color of the P element would be\ngreen. The declaration in the \"style\" attribute will override the one in\nthe STYLE element because of cascading rule 3, since it has a higher\nspecificity.",
      "rawLength": 2120
    },
    "preshint": {
      "id": "preshint",
      "heading": "6.4.4 Precedence of non-CSS presentational hints",
      "content": "The UA may choose to honor presentational attributes in an HTML source\ndocument. If so, these attributes are translated to the corresponding\nCSS rules with specificity equal to 0, and are treated as if they were\ninserted at the start of the author style sheet. They may therefore be\noverridden by subsequent style sheet rules. In a transition phase,\nthis policy will make it easier for stylistic attributes to coexist\nwith style sheets.\n\nFor HTML, any attribute that is not in the following list should be\nconsidered presentational: abbr, accept-charset, accept, accesskey,\naction, alt, archive, axis, charset, checked, cite, class, classid,\ncode, codebase, codetype, colspan, coords, data, datetime, declare,\ndefer, dir, disabled, enctype, for, headers, href, hreflang,\nhttp-equiv, id, ismap, label, lang, language, longdesc, maxlength,\nmedia, method, multiple, name, nohref, object, onblur, onchange,\nonclick, ondblclick, onfocus, onkeydown, onkeypress, onkeyup, onload,\nonload, onmousedown, onmousemove, onmouseout, onmouseover, onmouseup,\nonreset, onselect, onsubmit, onunload, onunload, profile, prompt,\nreadonly, rel, rev, rowspan, scheme, scope, selected, shape, span,\nsrc, standby, start, style, summary, title, type (except on LI, OL and \nUL elements), usemap, value, valuetype, version.\n\nFor other languages, all document language-based styling must be\ntranslated to the corresponding CSS and either enter the cascade at\nthe user agent level or, as with HTML presentational hints, be treated\nas author level rules with a specificity of zero placed at the start\nof the author style sheet.\n\nExample(s):\n\nThe following user style sheet would override the font weight of\n'b' elements in all documents, and the color of 'font'\nelements with color attributes in XML documents. It would not affect\nthe color of any 'font' elements with color attributes in HTML\ndocuments:\n\n```\n\nb { font-weight: normal; }\nfont[color] { color: orange; }\n\n```\n\nThe following, however, would override the color of font elements in all documents:\n\n```\n\nfont[color] { color: orange ! important; }\n\n```\n\n[previous](selector.html) \n[next](media.html) \n[contents](Overview.html#minitoc) \n[properties](propidx.html) \n[index](indexlist.html)",
      "rawLength": 2438
    }
  }
}