{
  "specName": "css22-ch9",
  "extractedAt": "2026-02-06T08:54:13.751Z",
  "totalSections": 28,
  "coreSections": 27,
  "sections": {
    "visual-model-intro": {
      "id": "visual-model-intro",
      "heading": "9.1 Introduction to the visual formatting model",
      "content": "This chapter and the next describe the visual formatting model: how user\nagents process the [document tree](conform.html#doctree)\nfor visual [media](media.html).\n\nIn the visual formatting model, each element in the document tree\ngenerates zero or more boxes according to the [box\nmodel](box.html). The layout of these boxes is governed by:\n\n- [box dimensions](box.html#box-dimensions) and [type](#box-gen).\n\n- [positioning scheme](#positioning-scheme)\n(normal flow, float, and absolute positioning).\n\n- relationships between elements\nin the [document tree.](conform.html#doctree)\n\n- external information (e.g., viewport size, [intrinsic](conform.html#intrinsic) dimensions of images, etc.).\n\nThe properties defined in this chapter and the next apply to both\n[continuous media](media.html#continuous-media-group) and\n[paged media](media.html#paged-media-group). \nHowever, the\nmeanings of the [margin\nproperties](box.html#margin-properties) vary when applied to paged media (see the [page model](page.html#page-margins) for details).\n\nThe visual formatting model does not specify all aspects of\nformatting (e.g., it does not specify a letter-spacing algorithm). [Conforming user agents](conform.html#conformance) may behave\ndifferently for those formatting issues not covered by this\nspecification.",
      "rawLength": 1618
    },
    "viewport": {
      "id": "viewport",
      "heading": "9.1.1 The viewport",
      "content": "User agents for [continuous media](media.html#continuous-media-group)\ngenerally offer users a \n**viewport** (a window or other\nviewing area on the screen) through which users consult a\ndocument. User agents may change the document's layout when the\nviewport is resized (see the [initial containing block](visudet.html#containing-block-details)).\n\nWhen the viewport is smaller than the area of the canvas on which\nthe document is rendered, the user agent should offer a scrolling\nmechanism.\n\nThere is at most\none viewport per [canvas](intro.html#canvas), but user\nagents may render to more than one canvas (i.e., provide different\nviews of the same document).",
      "rawLength": 783
    },
    "containing-block": {
      "id": "containing-block",
      "heading": "9.1.2 Containing blocks",
      "content": "In CSS 2.2, many box positions and sizes are calculated with respect\nto the edges\nof a rectangular box called a **containing block**. In\ngeneral, generated boxes act as containing blocks for descendant\nboxes; we say that a box \"establishes\" the containing block for its\ndescendants. The phrase \"a box's containing block\" means \"the\ncontaining block in which the box lives,\" not the one it generates.\n\nEach box is given a position with respect to its containing block,\nbut it is not confined by this containing block; it may [overflow](visufx.html#overflow).\n\nThe [details](visudet.html#containing-block-details) of\nhow a containing block's dimensions are calculated are described in\nthe [next chapter](visudet.html).",
      "rawLength": 861
    },
    "box-gen": {
      "id": "box-gen",
      "heading": "9.2 Controlling box generation",
      "content": "The following sections describe the types of boxes that may be\ngenerated in CSS 2.2. A box's type affects, in part, its behavior in the\nvisual formatting model. The ['display'](visuren.html#propdef-display) property, described below,\nspecifies a box's type.\n\nCertain values of the ['display'](visuren.html#propdef-display) property cause an element of\nthe source document to generate a **principal\nbox** that contains descendant boxes and generated\ncontent and is also the box involved in any positioning scheme. Some\nelements may generate additional boxes in addition to the principal\nbox: 'list-item' elements. These additional boxes are placed with\nrespect to the principal box.",
      "rawLength": 917
    },
    "block-boxes": {
      "id": "block-boxes",
      "heading": "9.2.1 Block-level elements and block boxes",
      "content": "**Block-level elements** –\nthose elements of the source document that are formatted visually as\nblocks (e.g., paragraphs) – are elements which generate a\nblock-level principal box. Values of the ['display'](visuren.html#propdef-display) property that make an\nelement block-level include: 'block', 'list-item', and 'table'. **Block-level\nboxes** are boxes that participate in a [block formatting context.](#block-formatting)\n\nIn CSS 2.2, a block-level box is also a block container box\nunless it is a table box or the principal box of a replaced element.\nA **block container box**\neither contains only block-level boxes or establishes an [inline formatting context](#inline-formatting) and thus\ncontains only [inline-level\nboxes.](#anonymous-block-level) An element whose principal box is a block container box is\na **block container\nelement.** Values of the 'display' property which make\na non-replaced element generate a block container include 'block',\n'list-item' and 'inline-block'. Not all block container boxes are\nblock-level boxes: non-replaced inline blocks and non-replaced table\ncells are block containers but are not block-level. Block-level boxes\nthat are also block containers are called **block boxes**.\n\nThe three terms \"block-level box,\" \"block container box,\" and\n\"block box\" are sometimes abbreviated as \"block\" where unambiguous.\n\n9.2.1.1 Anonymous block boxes\n\nIn a document like this:\n\n```\n\n<DIV>\n Some text\n <P>More text\n</DIV>\n\n```\n\n(and assuming the DIV and the P both have 'display: block'), the\nDIV appears to have both inline content and block content. To make it\neasier to define the formatting, we assume that there is an anonymous block box\naround \"Some text\".\n\n [[D]](images/longdesc/anon-block-desc.html) \n\nDiagram showing the\nthree boxes, of which one is anonymous, for the example above.\n\nIn other words: if a block container box (such as that generated\nfor the DIV above) has a block-level box inside it (such as the P\nabove), then we force it to have only block-level boxes\ninside it.\n\nWhen an inline box contains an in-flow block-level box, the inline box\n(and its inline ancestors within the same line box) is broken around\nthe block-level box (and any block-level siblings that are consecutive\nor separated only by collapsible whitespace and/or out-of-flow\nelements), splitting the inline box into two boxes (even if either\nside is empty), one on each side of the block-level box(es). The line\nboxes before the break and after the \nbreak are enclosed in anonymous block boxes, and the block-level box \nbecomes a sibling of those anonymous boxes. When such an inline box is \naffected by relative positioning, any resulting translation also\naffects the block-level box contained in the inline box.\n\nExample(s):\n\nThis model would apply in the following example if the following\nrules:\n\n```\n\np { display: inline }\nspan { display: block }\n\n```\n\nwere used with this HTML document:\n\n```\n\n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01//EN\">\n<HEAD>\n<TITLE>Anonymous text interrupted by a block</TITLE>\n</HEAD>\n<BODY>\n<P>\nThis is anonymous text before the SPAN.\n<SPAN>This is the content of SPAN.</SPAN>\nThis is anonymous text after the SPAN.\n</P>\n</BODY>\n\n```\n\nThe P element contains a chunk (C1) of anonymous text followed\nby a block-level element followed by another chunk (C2) of anonymous\ntext. The resulting boxes would be a block box representing the BODY,\ncontaining an anonymous block box around C1, the SPAN block box, and\nanother anonymous block box around C2.\n\nThe properties of anonymous boxes are inherited from the\nenclosing non-anonymous box (e.g., in the example just below the subsection heading \"Anonymous block boxes\", the one for DIV). \nNon-inherited properties have their initial value. For example,\nthe font of the anonymous box is inherited from the DIV, but the\nmargins will be 0.\n\nProperties set on elements that cause anonymous block boxes to be \ngenerated still apply to the boxes and content of that element. For \nexample, if a border had been set on the P element in the above \nexample, the border would be drawn around C1 (open at the end of the \nline) and C2 (open at the start of the line).\n\nSome user agents have implemented borders on inlines containing \nblocks in other ways, e.g., by wrapping such nested blocks inside \n\"anonymous line boxes\" and thus drawing inline borders around such \nboxes. As CSS1 and CSS2 did not define this behavior, CSS1-only and \nCSS2-only user agents may implement this alternative model and still \nclaim conformance to this part of CSS 2.2. This does not apply to UAs \ndeveloped after this specification was released.\n\nAnonymous block boxes are ignored when resolving percentage values\nthat would refer to it: the closest non-anonymous ancestor box is used\ninstead. For example, if the child of the anonymous block box inside\nthe DIV above needs to know the height of its containing block to\nresolve a percentage height, then it will use the height of the\ncontaining block formed by the DIV, not of the anonymous block box.",
      "rawLength": 6351
    },
    "inline-boxes": {
      "id": "inline-boxes",
      "heading": "9.2.2 Inline-level elements and inline boxes",
      "content": "**Inline-level\nelements** are those elements of the source document that\ndo not form new blocks of content; the content is distributed in lines\n (e.g., emphasized pieces of text\nwithin a paragraph, inline images,\netc.). The following values of the ['display'](visuren.html#propdef-display) property make an element\ninline-level: 'inline', 'inline-table', and 'inline-block'. \n\nInline-level elements generate **inline-level\nboxes**, which are boxes that participate in an inline\nformatting context.\n\nAn **inline\nbox** is one that is both inline-level and whose\ncontents participate in its containing inline formatting context. A\nnon-replaced element with a 'display' value of 'inline' generates an\ninline box.\nInline-level boxes that are not inline boxes (such as replaced\ninline-level elements, inline-block elements, and inline-table\nelements) are called **atomic inline-level boxes** because\nthey participate in their inline formatting context as a single opaque\nbox.\n\n9.2.2.1 Anonymous inline boxes\n\nAny text that is directly contained inside a block container element (not\ninside an inline element) must be treated as an anonymous inline\nelement.\n\nIn a document with HTML markup like this:\n\n```\n\n<p>Some <em>emphasized</em> text</p>\n\n```\n\nthe `<p>` generates a block box, with several inline boxes inside\nit. The box for \"emphasized\" is an inline box generated by an inline\nelement (`<em>`), but the other boxes (\"Some\" and \"text\") are inline boxes generated by a block-level element (`<p>`). The latter are called anonymous inline\nboxes, because they do not have an associated inline-level element.\n\nSuch anonymous inline boxes inherit inheritable properties from\ntheir block parent box. Non-inherited properties have their initial\nvalue. In the example, the color of the anonymous inline boxes is\ninherited from the P, but the background is transparent.\n\nWhite space content that would subsequently be collapsed away according to the ['white-space'](text.html#propdef-white-space) property does not generate any anonymous inline boxes.\n\nIf it is clear from the context which type of anonymous box is\nmeant, both anonymous inline boxes and anonymous block boxes are\nsimply called anonymous boxes in this specification.\n\nThere are more types of anonymous boxes that arise when formatting\n[tables](tables.html#anonymous-boxes).",
      "rawLength": 3128
    },
    "run-in": {
      "id": "run-in",
      "heading": "9.2.3 Run-in boxes",
      "content": "[This section exists so that the section numbers are the same as in\nprevious drafts. 'Display:\nrun-in' is now defined in CSS level 3 (see [CSS basic box model](https://www.w3.org/TR/css3-box/)).]",
      "rawLength": 282
    },
    "display-prop": {
      "id": "display-prop",
      "heading": "9.2.4 The 'display' property",
      "content": "Name:\n **display**Value:inline | block | list-item | inline-block |\ntable | inline-table | table-row-group | table-header-group |\ntable-footer-group | table-row | table-column-group | table-column |\ntable-cell | table-caption | none | [inherit](cascade.html#value-def-inherit)\nInitial:inline\nApplies to:all elements\nInherited:no\nPercentages:N/A\nMedia:[all](media.html#all-media-group)\nComputed value:see text\n\nThe values of this property have the following meanings:\n\nblock\n\nThis value causes an element to generate a principal block box.\n\ninline-block\n\nThis value causes an element to generate a principal inline-level block\ncontainer.\n(The inside of an inline-block is formatted as a block box, and the \nelement itself is formatted as an atomic inline-level box.)\n\ninline\n\nThis value causes an element to generate one or more inline boxes.\n\nlist-item\n\nThis value causes an element (e.g., LI in HTML) to generate a\nprincipal block box and a marker box. For information about\nlists and examples of list formatting, please consult the section on\n[lists](generate.html#lists).\n\nnone\n\nThis\nvalue causes an element to not appear in the [formatting structure](intro.html#formatting-structure) (i.e.,\nin visual media the element generates no boxes and has no effect on\nlayout). Descendant elements do not generate any boxes either; the\nelement and its content are removed from the formatting structure\nentirely. This behavior cannot be overridden by\nsetting the ['display'](visuren.html#propdef-display) property\non the descendants.\n\nPlease note that a display of 'none' does not create an invisible\nbox; it creates no box at all. CSS includes mechanisms that enable an\nelement to generate boxes in the formatting structure that affect\nformatting but are not visible themselves. Please consult the section\non [visibility](visufx.html#visibility) for details.\n\n[table](tables.html#value-def-table),\n[inline-table](tables.html#value-def-inline-table),\n[table-row-group](tables.html#value-def-table-row-group),\n[table-column](tables.html#value-def-table-column),\n[table-column-group](tables.html#value-def-table-column-group),\n[table-header-group](tables.html#value-def-table-header-group),\n[table-footer-group](tables.html#value-def-table-footer-group),\n[table-row](tables.html#value-def-table-row),\n[table-cell](tables.html#value-def-table-cell), and\n[table-caption](tables.html#value-def-table-caption)\n\nThese values cause an element to behave like a table element\n(subject to restrictions described in the chapter on [tables](tables.html)).\n\nThe computed value is the same as the specified value, except for\npositioned and floating elements (see [Relationships between 'display', 'position', and\n'float'](#dis-pos-flo)) and for the root element. \n\nFor the root element, the computed value is changed as described in \nthe section on the [relationships between 'display', 'position', and 'float'](#dis-pos-flo).\n\nNote that although the [initial\nvalue](about.html#initial-value) of ['display'](visuren.html#propdef-display) is\n'inline', rules in the user agent's [default style sheet](cascade.html#default-style-sheet) may [override](cascade.html) this value. See the [sample style sheet](sample.html) for HTML 4 in the\nappendix.\n\nExample(s):\n\nHere are some examples of the ['display'](visuren.html#propdef-display) property:\n\n```\n\np { display: block }\nem { display: inline }\nli { display: list-item } \nimg { display: none } /* Do not display images */\n\n```",
      "rawLength": 5644
    },
    "positioning-scheme": {
      "id": "positioning-scheme",
      "heading": "9.3 Positioning schemes",
      "content": "In CSS 2.2, a box may be laid out according to three **positioning\nschemes:**\n\n- [Normal flow](#normal-flow). In CSS 2.2, normal\nflow includes [block formatting](#block-formatting)\nof block-level boxes, \n[inline formatting](#inline-formatting)\nof inline-level boxes, and [relative positioning](#relative-positioning) of\nblock-level and inline-level boxes.\n\n- [Floats](#floats). In the float model,\na box is first laid out according to the normal flow, then \ntaken out of the flow and shifted\nto the left or right as far as possible. Content may\nflow along the side of a float.\n\n- [Absolute positioning](#absolute-positioning). \nIn the absolute positioning model, a box is removed from\nthe normal flow entirely (it has no impact on later siblings)\nand assigned a position with respect to a containing block.\n\nAn element is called out of\nflow if it is floated, absolutely positioned, or is the\nroot element. An element is called in-flow if it is not out-of-flow. The\nflow of an element\nA is the set consisting of A and all in-flow\nelements whose nearest out-of-flow ancestor is A.\n\nNote.\nCSS 2.2's positioning schemes help authors make their documents\nmore accessible by allowing them to avoid mark-up tricks\n(e.g., invisible images) used for layout effects.",
      "rawLength": 1733
    },
    "choose-position": {
      "id": "choose-position",
      "heading": "9.3.1 Choosing a positioning scheme: 'position' property",
      "content": "The ['position'](visuren.html#propdef-position) and ['float'](visuren.html#propdef-float) properties determine which \nof the CSS 2.2 positioning algorithms is used to calculate \nthe position of a box.\n\n \n \n Name:\n **position**Value:static | relative | absolute | fixed | [inherit](cascade.html#value-def-inherit)\nInitial:static\nApplies to:all elements\nInherited:no\nPercentages:N/A\nMedia:[visual](media.html#visual-media-group)\nComputed value:as specified\n\nThe values of this property have the following meanings:\n\nstatic\n\nThe box is a normal box, laid out according to the [normal flow](#normal-flow). The \n['top'](visuren.html#propdef-top), \n['right'](visuren.html#propdef-right), \n['bottom'](visuren.html#propdef-bottom),\nand ['left'](visuren.html#propdef-left)\nproperties do not apply. \n\nrelative\n\nThe box's position is calculated according to the [normal flow](#normal-flow) (this is called the position in\nnormal flow). Then the box is offset [relative](#relative-positioning) to its normal position. When\na box B is relatively positioned, the position of the following box is\ncalculated as though B were not offset. The effect of 'position:relative' on table-row-group, table-header-group, table-footer-group, table-row, table-column-group, table-column, table-cell, and table-caption elements is undefined.\n\nabsolute\n The box's position (and possibly size) is specified\nwith the ['top'](visuren.html#propdef-top),\n['right'](visuren.html#propdef-right), \n['bottom'](visuren.html#propdef-bottom), and\n['left'](visuren.html#propdef-left)\nproperties.\nThese properties specify offsets with respect to the box's \n[containing block](#containing-block). Absolutely\npositioned boxes are taken out of the normal flow. This means\nthey have no impact on the layout of later siblings. Also,\nthough [absolutely positioned](#absolutely-positioned) \nboxes have margins, they\ndo not [collapse](box.html#collapsing-margins)\nwith any other margins.\n\nfixed\n The box's position is calculated according to the 'absolute'\nmodel, but in addition, the box is [fixed](#fixed-positioning) with respect to some reference. \nAs with the 'absolute' model, the box's margins do not collapse with any other margins.\nIn the case of handheld, projection, screen, tty, and tv media types, \nthe box is fixed with respect to the [viewport](#viewport) \nand does not move when \nscrolled. In the case of the print media type, the box is rendered on every page, and is fixed with respect to the page box, even if the page is seen through a [viewport](#viewport) \n(in the case of a print-preview, for example). For other media \ntypes, the presentation is undefined. \nAuthors may wish to specify 'fixed' in a\nmedia-dependent way. For instance, an author may want a box to remain\nat the top of the [viewport](#viewport) on the screen, but\nnot at the top of each printed page. The two specifications may be\nseparated by using an [@media\nrule](media.html#at-media-rule), as in:\n\nExample(s):\n\n```\n \n@media screen { \n h1#first { position: fixed } \n}\n@media print { \n h1#first { position: static }\n}\n\n```\n \n\nUAs must not paginate the content of fixed boxes. Note that UAs may print invisible content in other\nways. See [\"Content outside the\npage box\"](page.html#outside-page-box) in chapter 13.\n\nUser agents may treat position as 'static' on the root element.",
      "rawLength": 4714
    },
    "position-props": {
      "id": "position-props",
      "heading": "9.3.2 Box offsets: 'top', 'right', 'bottom', 'left'",
      "content": "An element is said to be **positioned**\nif its ['position'](visuren.html#propdef-position) property has\na value other than 'static'. Positioned elements generate\npositioned boxes, laid out according to four properties:\n\n \n \n Name:\n **top**Value:[<length>](syndata.html#value-def-length) | [<percentage>](syndata.html#value-def-percentage) | auto | [inherit](cascade.html#value-def-inherit)\nInitial:auto\nApplies to:positioned elements\nInherited:no\nPercentages:refer to height of containing block\nMedia:[visual](media.html#visual-media-group)\nComputed value:if\n specified as a length, the corresponding absolute length; if\n specified as a percentage, the specified value; otherwise, 'auto'.\n\nThis property specifies how far an [absolutely positioned](#absolutely-positioned) box's top\nmargin edge is offset below the top edge of the box's [containing block](#containing-block). For relatively\npositioned boxes, the offset is with respect to the top edges of the\nbox itself (i.e., the box is given a position in the normal flow, then\noffset from that position according to these properties).\n\n \n \n Name:\n **right**Value:[<length>](syndata.html#value-def-length) | [<percentage>](syndata.html#value-def-percentage) | auto | [inherit](cascade.html#value-def-inherit)\nInitial:auto\nApplies to:positioned elements\nInherited:no\nPercentages:refer to width of containing block\nMedia:[visual](media.html#visual-media-group)\nComputed value:if\n specified as a length, the corresponding absolute length; if\n specified as a percentage, the specified value; otherwise,\n 'auto'.\n\nLike 'top', but specifies how far a box's right margin edge is\noffset to the left of the right edge of the box's [containing block](#containing-block). For relatively\npositioned boxes, the offset is with respect to the right edge of the\nbox itself.\n\n \n \n Name:\n **bottom**Value:[<length>](syndata.html#value-def-length) | [<percentage>](syndata.html#value-def-percentage) | auto | [inherit](cascade.html#value-def-inherit)\nInitial:auto\nApplies to:positioned elements\nInherited:no\nPercentages:refer to height of containing block\nMedia:[visual](media.html#visual-media-group)\nComputed value:if\n specified as a length, the corresponding absolute length; if\n specified as a percentage, the specified value; otherwise, 'auto'.\n\nLike 'top', but specifies how far a box's bottom margin edge is\noffset above the bottom of the box's [containing block](#containing-block). For relatively\npositioned boxes, the offset is with respect to the bottom edge of the\nbox itself.\n\n \n \n Name:\n **left**Value:[<length>](syndata.html#value-def-length) | [<percentage>](syndata.html#value-def-percentage) | auto | [inherit](cascade.html#value-def-inherit)\nInitial:auto\nApplies to:positioned elements\nInherited:no\nPercentages:refer to width of containing block\nMedia:[visual](media.html#visual-media-group)\nComputed value:if\n specified as a length, the corresponding absolute length; if\n specified as a percentage, the specified value; otherwise,\n 'auto'.\n\nLike 'top', but specifies how far a box's left margin edge is\noffset to the right of the left edge of the box's [containing block](#containing-block). For relatively\npositioned boxes, the offset is with respect to the left edge of the\nbox itself.\n\nThe values for the four properties have the following meanings:\n\n[<length>](syndata.html#value-def-length)\nThe offset is a fixed distance from the reference edge. Negative values are allowed.\n\n[<percentage>](syndata.html#value-def-percentage)\n\nThe offset is a percentage of the containing block's width (for ['left'](visuren.html#propdef-left) or ['right'](visuren.html#propdef-right)) or height (for ['top'](visuren.html#propdef-top) and ['bottom'](visuren.html#propdef-bottom)). Negative values are allowed.\n\nauto\nFor non-replaced elements, the effect of this value \ndepends on which of related properties have the value 'auto' as\nwell. See the sections on the \n[width](visudet.html#abs-non-replaced-width)\nand [height](visudet.html#abs-non-replaced-height)\nof [absolutely positioned](#absolutely-positioned), \nnon-replaced elements for details. For replaced elements, the\neffect of this value depends only on the intrinsic dimensions of the\nreplaced content. See the sections on the [width](visudet.html#abs-replaced-width) and [height](visudet.html#abs-replaced-height) of absolutely\npositioned, replaced elements for details.",
      "rawLength": 7134
    },
    "normal-flow": {
      "id": "normal-flow",
      "heading": "9.4 Normal flow",
      "content": "Boxes in the normal flow belong to a formatting context, which in CSS 2.2\nmay be table, block or inline. In future levels of CSS, other types of\nformatting context will be introduced. [Block-level](#block-level) boxes participate in a [block formatting](#block-formatting) context. [Inline-level boxes](#inline-level) participate in an [inline formatting](#inline-formatting) context. Table\nformatting contexts are described in the [chapter on tables.](tables.html)",
      "rawLength": 615
    },
    "block-formatting": {
      "id": "block-formatting",
      "heading": "9.4.1 Block formatting contexts",
      "content": "Floats, absolutely positioned elements, block containers (such as\ninline-blocks, table-cells, and table-captions) that are not block\nboxes, and block boxes with 'overflow' other than 'visible'\n(except when that value has been propagated to the viewport) establish\nnew block formatting contexts for their contents.\n\nIn a block formatting context, boxes are laid out one after the\nother, vertically, beginning at the top of a containing block. The\nvertical distance between two sibling boxes is determined by the ['margin'](box.html#propdef-margin) properties. Vertical margins\nbetween adjacent block-level boxes in a block formatting context [collapse](box.html#collapsing-margins).\n\nIn a block formatting context, each box's left outer edge touches the\nleft edge of the containing block (for right-to-left formatting, right\nedges touch). This is true even in the presence of floats (although a\nbox's line boxes may shrink due to the floats), unless the box\nestablishes a new block formatting context (in which case the box itself\n[may become narrower](#bfc-next-to-float) due to\nthe floats).\n\nFor information about page breaks in paged media, please consult\nthe section on [allowed\npage breaks](page.html#allowed-page-breaks).",
      "rawLength": 1377
    },
    "inline-formatting": {
      "id": "inline-formatting",
      "heading": "9.4.2 Inline formatting contexts",
      "content": "An inline formatting context is established by a block container\nbox that contains no block-level boxes.\nIn an inline formatting context, boxes are laid out horizontally,\none after the other, beginning at the top of a containing\nblock. Horizontal margins, borders, and padding are respected between\nthese boxes. The boxes may be aligned vertically in different ways: their\nbottoms or tops may be aligned, or the baselines of text within them\nmay be aligned. The rectangular area that contains the boxes that form\na line is called a **line box**. \n\nThe width of a line box is determined by a [containing block](#containing-block) and the presence of floats. \nThe height of a line\nbox is determined by the rules given in the section on [line height calculations](visudet.html#line-height). \n\nA line box is always tall enough for all of the boxes it contains. \nHowever, it may be taller than the tallest box it contains \n(if, for example, boxes are aligned so that baselines line up). \nWhen the height of a box B is less than the height of the line box containing it, \nthe vertical alignment of B within the line box is determined by \nthe ['vertical-align'](visudet.html#propdef-vertical-align) property.\nWhen several inline-level boxes cannot fit horizontally within a single\nline box, they are distributed among two or more vertically-stacked\nline boxes. Thus, a paragraph is a vertical stack of line boxes. Line\nboxes are stacked with no vertical separation (except as specified\nelsewhere) and they never overlap.\n\nIn general, the left edge of a line box touches the left edge\nof its containing block and the right edge touches the right edge of\nits containing block. However, floating boxes may come between the\ncontaining block edge and the line box edge. Thus, although line\nboxes in the same inline formatting context generally have the same\nwidth (that of the containing block), they may vary in width if\navailable horizontal space is reduced due to [floats](#floats). Line boxes in the same inline formatting\ncontext generally vary in height (e.g., one line might contain a tall\nimage while the others contain only text).\n\nWhen the total width of the inline-level boxes on a line is less than the\nwidth of the line box containing them, their horizontal distribution\nwithin the line box is determined by the ['text-align'](text.html#propdef-text-align) property. If that\nproperty has the value 'justify', the user agent may stretch spaces\nand words in inline boxes (but not inline-table and inline-block\nboxes) as well.\n\nWhen an inline box exceeds the width of a line box, it is split into several boxes and these boxes are distributed across several line boxes. If an inline box cannot be split (e.g., if the inline box contains a single character, or language specific word breaking rules disallow a break within the inline box, or if the inline box is affected by a white-space value of nowrap or pre), then the inline box overflows the line box.\n\nWhen an inline box is split, margins,\nborders, and padding have no visual effect where the split occurs (or\nat any split, when there are several).\n\nInline boxes may also be split into several boxes within the\nsame line box due to [bidirectional text\nprocessing](#direction).\n\nLine boxes are created as needed to hold\ninline-level content within an inline formatting context. Line boxes\nthat contain no text, no [preserved white space,](text.html#white-space-prop) no inline\nelements with non-zero margins, padding, or borders, and no other [in-flow](#positioning-scheme) content (such as images, inline\nblocks or inline tables), and do not end with a preserved newline must\nbe treated as zero-height line boxes for the purposes of determining\nthe positions of any elements inside of them, and must be treated as\nnot existing for any other purpose.\n\n \nHere is an example of inline box construction. The following paragraph\n(created by the HTML block-level element P) contains anonymous text\ninterspersed with the elements EM and STRONG:\n\n```\n\n<P>Several <EM>emphasized words</EM> appear\n<STRONG>in this</STRONG> sentence, dear.</P>\n\n```\n\nThe P element generates a block box that contains five inline\nboxes, three of which are anonymous:\n\n- Anonymous: \"Several\"\n\n- EM: \"emphasized words\"\n\n- Anonymous: \"appear\"\n\n- STRONG: \"in this\"\n\n- Anonymous: \"sentence, dear.\"\n\n \n\nTo format the paragraph, the user agent flows the five boxes into\nline boxes. In this example, the box generated for the P element\nestablishes the containing block for the line boxes. If the containing\nblock is sufficiently wide, all the inline boxes will fit into a\nsingle line box:\n\n```\n\n Several emphasized words appear in this sentence, dear.\n\n```\n\nIf not, the inline boxes will be split up and distributed across\nseveral line boxes. The previous paragraph might be split as follows:\n\n```\n\nSeveral emphasized words appear\nin this sentence, dear.\n\n```\n\nor like this:\n\n```\n\nSeveral emphasized \nwords appear in this \nsentence, dear.\n\n```\n\nIn the previous example, the EM box was split into two EM boxes\n(call them \"split1\" and \"split2\"). Margins, borders,\npadding, or text decorations have no visible effect after split1 or\nbefore split2.\n\nConsider the following example:\n\n```\n\n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01//EN\">\n<HTML>\n <HEAD>\n <TITLE>Example of inline flow on several lines</TITLE>\n <STYLE type=\"text/css\">\n EM {\n padding: 2px; \n margin: 1em;\n border-width: medium;\n border-style: dashed;\n line-height: 2.4em;\n }\n </STYLE>\n </HEAD>\n <BODY>\n <P>Several <EM>emphasized words</EM> appear here.</P>\n </BODY>\n</HTML>\n\n```\n\nDepending on the width of the P, the boxes may be distributed as\nfollows:\n\n [[D]](images/longdesc/inline-layout-desc.html)\n\n- The margin is inserted before \"emphasized\" and after \"words\". \n\n- The padding is inserted before, above, and below\n\"emphasized\" and after, above, and below \"words\". A\ndashed border is rendered on three sides in each case.",
      "rawLength": 7167
    },
    "relative-positioning": {
      "id": "relative-positioning",
      "heading": "9.4.3 Relative positioning",
      "content": "Once a box has been laid out according to the [normal flow](#normal-flow) or floated, it may be shifted relative to\nthis position. This is called **relative positioning**. Offsetting a box\n(B1) in this way has no effect on the box (B2) that follows: B2 is\ngiven a position as if B1 were not offset and B2 is not re-positioned\nafter B1's offset is applied. This implies that relative positioning\nmay cause boxes to overlap.\nHowever, if relative positioning causes an 'overflow:auto' or\n'overflow:scroll' box to have\noverflow, the UA must allow the user to access this content (at its offset\nposition), which, through the creation of scrollbars, may affect layout.\n\nA relatively positioned box keeps its normal flow size, including\nline breaks and the space originally reserved for it. The section on\n[containing blocks](#containing-block) explains when a\nrelatively positioned box establishes a new containing block.\n\nFor relatively positioned elements, 'left' and 'right' move the\nbox(es) horizontally, without changing their size. 'Left' moves the\nboxes to the right, and 'right' moves them to the left. Since boxes\nare not split or stretched as a result of 'left' or 'right', the\nused values are always: left = -right.\n\nIf both 'left' and 'right' are 'auto' (their initial values), the\nused values are '0' (i.e., the boxes stay in their original\nposition).\n\nIf 'left' is 'auto', its used value is minus the value of 'right'\n(i.e., the boxes move to the left by the value of 'right').\n\nIf 'right' is specified as 'auto', its used value is minus the\nvalue of 'left'.\n\nIf neither 'left' nor 'right' is 'auto', the position is\nover-constrained, and one of them has to be ignored. If the 'direction' property of the containing block is 'ltr', the value of 'left' wins and 'right'\nbecomes -'left'. If 'direction' of the containing block is 'rtl', 'right' wins and 'left' is ignored.\n\nExample(s):\n\nExample. The following three rules are equivalent:\n\n```\n\ndiv.a8 { position: relative; direction: ltr; left: -1em; right: auto }\ndiv.a8 { position: relative; direction: ltr; left: auto; right: 1em }\ndiv.a8 { position: relative; direction: ltr; left: -1em; right: 5em }\n\n```\n\nThe 'top' and 'bottom' properties move relatively positioned\nelement(s) up or down without changing their size. 'Top' moves the\nboxes down, and 'bottom' moves them up. Since boxes\nare not split or stretched as a result of 'top' or 'bottom', the\nused values are always: top = -bottom.\nIf both are 'auto', their used values are both '0'. If one of them is\n'auto', it becomes the negative of the other. If neither is 'auto',\n'bottom' is ignored (i.e., the used value of 'bottom' will be\nminus the value of 'top').\n\nNote. \nDynamic movement of relatively positioned boxes can produce\nanimation effects in scripting environments (see also the ['visibility'](visufx.html#propdef-visibility) property). \nAlthough relative positioning may be used as a form of superscripting and \nsubscripting, the line height is not automatically adjusted to take the \npositioning into consideration. See the description of [line height calculations](visudet.html#line-height) for more\ninformation.\n\nExamples of relative positioning are provided in the section [comparing normal flow, floats, and absolute\npositioning](#comparison).",
      "rawLength": 3668
    },
    "floats": {
      "id": "floats",
      "heading": "9.5 Floats",
      "content": "A float is a box that is shifted to the left or right on the\ncurrent line. The most interesting characteristic of a float (or\n\"floated\" or \"floating\" box) is that content may flow along its side\n(or be prohibited from doing so by the ['clear'](visuren.html#propdef-clear) property). Content flows down\nthe right side of a left-floated box and down the left side of a\nright-floated box. The following is an introduction to float\npositioning and content flow; the exact [rules](#float-rules) governing float behavior are given in\nthe description of the ['float'](visuren.html#propdef-float)\nproperty.\n\nA floated box is\nshifted to the left or right until its outer edge touches the\ncontaining block edge or the outer edge of another float. \nIf there is a line box, the outer top of the floated box is aligned with \nthe top of the current line box.\n\nIf there is not enough horizontal room for the\nfloat, it is shifted downward until either it fits or there are no\nmore floats present.\n\nSince a float is not in the flow, non-positioned block boxes\ncreated before and after the float box flow vertically as if the float\ndid not exist. However,\nthe current and subsequent\nline boxes created next to the float are\nshortened\nas necessary\nto make room for the margin box of the float.\n\nA line box is next to a float when there exists a vertical position\nthat satisfies all of these four conditions: (a) at or below the top\nof the line box, (b) at or above the bottom of the line box, (c) below\nthe top margin edge of the float, and (d) above the bottom margin edge\nof the float.\n\nNote: this means that floats with zero outer height or\nnegative outer height do not shorten line boxes.\n\nIf a shortened line box is too small to contain any content, then\nthe line box is shifted downward (and its width recomputed) until\neither some content fits or there are no more floats present.\nAny content in the current line before a floated box is reflowed \nin the same line on the other side of the float.\nIn other words, if inline-level boxes are placed \non the line before a left float is encountered that fits in the remaining line box space, \nthe left float is placed on that line, aligned with the top of the line box, and then the inline-level boxes already on the line are moved accordingly to the right of the float (the right being the other side of the left float) and vice versa for rtl and right floats.\n\nThe border box of a table, a block-level replaced element, or an element in the normal flow that establishes a new [block formatting context](visuren.html#block-formatting) \n(such as an element with 'overflow' other than 'visible')\nmust not overlap the margin box of any floats in the same block\nformatting context as\nthe element itself. If necessary, implementations should clear the\nsaid element by placing it below any preceding floats, but may place\nit adjacent to such floats if there is sufficient space.\nThey may even make the border box of said element narrower than\ndefined by [section 10.3.3.](visudet.html#blockwidth)\nCSS2 does not define when a UA may put said element next to the float\nor by how much said element may become narrower.\n\nExample(s):\n\nExample. \nIn the following document fragment, the containing block is too narrow \nto contain the content next to the float, \nso the content gets moved to below the floats \nwhere it is aligned in the line box according to the text-align \nproperty.\n\n```\n\np { width: 10em; border: solid aqua; }\nspan { float: left; width: 5em; height: 5em; border: solid blue; }\n\n...\n\n<p>\n <span> </span>\n Supercalifragilisticexpialidocious\n</p>\n\n```\n\nThis fragment might look like this:\n\nSeveral floats may be adjacent, and this model also applies to\nadjacent floats in the same line.\n\nExample(s):\n\nThe following rule floats all IMG boxes with\nclass=\"icon\" to the left (and\nsets the left margin to '0'):\n\n```\n\nimg.icon { \n float: left;\n margin-left: 0;\n}\n\n```\n\nConsider the following HTML source and style sheet:\n\n```\n \n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01//EN\">\n<HTML>\n <HEAD>\n <TITLE>Float example</TITLE>\n <STYLE type=\"text/css\">\n IMG { float: left }\n BODY, P, IMG { margin: 2em }\n </STYLE>\n </HEAD>\n <BODY>\n <P><IMG src=img.png alt=\"This image will illustrate floats\">\n Some sample text that has no other...\n </BODY>\n</HTML>\n\n```\n\nThe IMG box is floated to the left. The content that follows is\nformatted to the right of the float, starting on the same line as the\nfloat. The line boxes to the right of the float are shortened due to\nthe float's presence, but resume their \"normal\" width (that of the\ncontaining block established by the P element) after the float. This\ndocument might be formatted as:\n\n [[D]](images/longdesc/floateg-desc.html)\n\nFormatting would have been exactly the same if the document had\nbeen:\n\n```\n\n<BODY>\n <P>Some sample text \n <IMG src=img.png alt=\"This image will illustrate floats\">\n that has no other...\n</BODY>\n\n```\n\nbecause the content to the left of the float is displaced by\nthe float and reflowed down its right side.\n\nAs stated in [section 8.3.1](box.html#collapsing-margins), \nthe margins of floating boxes never [collapse](box.html#collapsing-margins) with margins of\nadjacent boxes. Thus, in the previous example, vertical margins do not\n[collapse](box.html#collapsing-margins) between the P box\nand the floated IMG box.\n\nThe contents of floats are stacked as if floats generated new \nstacking contexts, except that any positioned elements and elements\nthat actually create new\nstacking contexts take part in the float's parent stacking context. \nA float can overlap other boxes in the normal flow (e.g., when a \nnormal flow box next to a float has negative margins). When this \nhappens, floats are rendered in front of non-positioned in-flow \nblocks, but behind in-flow inlines.\n\nExample(s):\n\nHere is another illustration, showing what happens when a float\noverlaps borders of elements in the normal flow.\n\n [[D]](images/longdesc/float2p-desc.html)\n\nA floating image obscures borders\nof block boxes it overlaps.\n\nThe following example illustrates the use of the ['clear'](visuren.html#propdef-clear) property to prevent content\nfrom flowing next to a float.\n\nExample(s):\n\nAssuming a rule such as this:\n\n```\n\np { clear: left }\n\n```\n\nformatting might look like this:\n\n [[D]](images/longdesc/floatclear-desc.html)\n\nBoth paragraphs have set 'clear: left', which\ncauses the second paragraph to be \"pushed down\" to a position below\nthe float — \"clearance\" is added above its top margin to\naccomplish this (see the ['clear'](visuren.html#propdef-clear) property).",
      "rawLength": 8929
    },
    "float-position": {
      "id": "float-position",
      "heading": "9.5.1 Positioning the float: the 'float' property",
      "content": "Name:\n **float**Value:left | right | none | [inherit](cascade.html#value-def-inherit)\nInitial:none\nApplies to:all, but see [9.7](visuren.html#dis-pos-flo)\nInherited:no\nPercentages:N/A\nMedia:[visual](media.html#visual-media-group)\nComputed value:as specified\n\nThis property specifies whether a box should float to the left,\nright, or not at all. It may be set for any element, but only applies to \nelements that generate boxes that are not \n[absolutely positioned](#absolutely-positioned). \nThe values of this property have\nthe following meanings:\n\nleft\n\nThe element generates a [block](#block-boxes) box that is\nfloated to the left. Content flows on the right side of the box,\nstarting at the top (subject to the ['clear'](visuren.html#propdef-clear) property). \n\nright\n\nSimilar to 'left', except the box is floated to the right, and content flows on the left side of the box, starting at the top.\n\nnone\n\nThe box is not floated.\n\nUser agents may treat float as 'none' on the root element. \n\nHere are the precise rules that\ngovern the behavior of floats:\n\n- The left [outer edge](box.html#outer-edge) of a\nleft-floating box may not be to the left of the left edge of its [containing block](#containing-block). An\nanalogous rule holds for right-floating elements.\n\n- If the current box is left-floating, and there are any left-floating \nboxes generated by elements earlier in the source document,\nthen for each such earlier box, either the left [outer edge](box.html#outer-edge) of the current box must be\nto the right of the right [outer edge](box.html#outer-edge)\nof the earlier box, or its top must be lower than the bottom of the\nearlier box. Analogous rules hold for right-floating boxes.\n\n- The right [outer edge](box.html#outer-edge) of a\nleft-floating box may not be to the right of the left [outer edge](box.html#outer-edge) of any right-floating\nbox that is next to it. Analogous rules hold for\nright-floating elements.\n\n- A floating box's [outer top](box.html#outer-edge)\nmay not be higher than the top of its [containing block](#containing-block).\nWhen the float occurs between two collapsing margins, the\nfloat is positioned as if it had an otherwise empty [anonymous block parent](#anonymous-block-level) taking part in\nthe flow. The position of such a parent is defined by [the rules](box.html#collapsed-through) in the section on margin\ncollapsing.\n\n- The [outer top](box.html#outer-edge) of a floating box\nmay not be higher than the outer top of any [block](#block-boxes) or [floated](#floats) box generated by an element\nearlier in the source document.\n\n- The [outer top](box.html#outer-edge) of an element's\nfloating box may not be higher than the top of any [line-box](#line-box) containing a box\ngenerated by an element earlier in the source document.\n\n- A left-floating box that has another left-floating box to its left\nmay not have its right outer edge to the right of its containing\nblock's right edge. (Loosely: a left float may not stick out at the\nright edge, unless it is already as far to the left as possible.) An\nanalogous rule holds for right-floating elements.\n\n- A floating box must be placed as high as possible.\n\n- A left-floating box must be put as far to the left as\npossible, a right-floating box as far to the right as possible. A\nhigher position is preferred over one that is further to the\nleft/right.\n\nBut in CSS 2.2, if, within the block formatting context, there\nis an in-flow negative vertical margin such that the float's position\nis above the position it would be at were all such negative margins\nset to zero, the position of the float is undefined.\n\nReferences to other elements in these rules refer only to other elements in the same [block formatting context](#block-formatting) as the float.\n\nExample(s):\n\nThis HTML fragment results in the b floating to the right.\n\n```\n<P>a<SPAN style=\"float: right\">b</SPAN></P>\n```\n\nIf the P element's width is enough, the a and the b will be side by\nside. It might look like this:",
      "rawLength": 5159
    },
    "flow-control": {
      "id": "flow-control",
      "heading": "9.5.2 Controlling flow next to floats: the 'clear' property",
      "content": "Name:\n **clear**Value:none | left | right | both | [inherit](cascade.html#value-def-inherit)\nInitial:none\nApplies to:block-level elements\nInherited:no\nPercentages:N/A\nMedia:[visual](media.html#visual-media-group)\nComputed value:as specified\n\nThis property indicates which sides of an element's box(es) may\nnot be adjacent to an earlier floating box. The 'clear'\nproperty does not consider floats inside the element itself or in\nother [block formatting\ncontexts.](visuren.html#block-formatting)\n\nValues have the following meanings when applied to non-floating\nblock-level boxes:\n\nleft\n\nRequires that the top border edge of the box be below the bottom\nouter edge of any left-floating boxes that resulted from elements\nearlier in the source document.\n\nright\n\nRequires that the top border edge of the box be below the bottom\nouter edge of any right-floating boxes that resulted from elements\nearlier in the source document.\n\nboth\n\nRequires that the top border edge of the box be below the bottom\nouter edge of any right-floating and left-floating boxes that resulted\nfrom elements earlier in the source document.\n\nnone\n\nNo constraint on the box's position with respect to floats.\n\nValues other than 'none' potentially introduce clearance.\nClearance inhibits margin collapsing\nand acts as spacing above the margin-top of an element. It is used to\npush the element vertically past the float.\n\nComputing the clearance of an element on which 'clear' is set is\ndone by first determining the hypothetical position of the element's\ntop border edge. This position is\nwhere the actual top border edge would have been if the element's\n'clear' property had been 'none'.\n\nIf this hypothetical position of the element's top border edge is\nnot past the relevant floats, then clearance is introduced, and\nmargins collapse according to the rules in 8.3.1.\n\nThen the amount of clearance is set to the greater of:\n\n - The amount necessary to place the border edge of the block even\n with the bottom outer edge of the lowest float that is to be\n cleared.\n \n The amount necessary to place the top border edge of the block\n at its hypothetical position.\n\nAlternatively, clearance is set exactly to the amount necessary to\nplace the border edge of the block even with the bottom outer edge of\nthe lowest float that is to be cleared.\n\nNote: Both behaviors are allowed\npending evaluation of their compatibility with existing Web content. A\nfuture CSS specification will require either one or the other.\n\nNote: The clearance can be negative or zero.\n\nExample(s):\n\nExample 1. Assume (for the sake of simplicity), that we have just\nthree boxes, in this order: block B1 with a bottom margin of M1 (B1\nhas no children and no padding or border), floating block F with a\nheight H, and block B2 with a top margin of M2 (no padding or border,\nno children). B2 has 'clear' set to 'both'. We also assume B2 is not\nempty.\n\nWithout considering the 'clear' property on B2, we have the situation in \nthe diagram below. The margins of B1 and B2 collapse. Let's say the \nbottom border edge of B1 is at y = 0, then the top of F is at y = M1, \nthe top border edge of B2 is at y = max(M1,M2), and the bottom of F is \nat y = M1 + H.\n\nWe also assume that B2 is not below F, i.e., we are in the\nsituation described in the spec where we need to add clearance. That\nmeans:\n\nmax(M1,M2) < M1 + H\n\nWe need to compute clearance C twice, C1 and C2, and \nkeep the greater of the two: C = max(C1,C2). The first way is to put \nthe top of B2 flush with the bottom of F, i.e., at y = M1 + H. That \nmeans, because the margins no longer collapse with a clearance between \nthem:\n\n bottom of F = top border edge of B2 ⇔\n M1 + H = M1 + C1 + M2 ⇔\n C1 = M1 + H - M1 - M2\n = H - M2\n\nThe second computation is to keep the top of B2 where it is, i.e., at y \n= max(M1,M2). That means:\n\n max(M1,M2) = M1 + C2 + M2 ⇔\n C2 = max(M1,M2) - M1 - M2\n\nWe assumed that max(M1,M2) < M1 + H, which implies\n\n C2 = max(M1,M2) - M1 - M2 < M1 + H - M1 - M2 = H - M2 ⇒\n C2 < H - M2\n\nAnd, as C1 = H - M2, it follows that\n\n C2 < C1\n\nand hence\n\n C = max(C1,C2) = C1\n\nExample(s):\n\nExample 2. An example of negative clearance is this situation, in\nwhich the\nclearance is -1em. (Assume none of the elements have borders or\npadding):\n\n```\n\n<p style=\"margin-bottom: 4em\">\n First paragraph.\n\n<p style=\"float: left; height: 2em; margin: 0\">\n Floating paragraph.\n\n<p style=\"clear: left; margin-top: 3em\">\n Last paragraph.\n\n```\n\nExplanation: Without the 'clear', the first and last paragraphs'\nmargins would collapse and the last paragraph's top border edge would\nbe flush with the top of the floating paragraph. But the 'clear'\nrequires the top border edge to be below the float, i.e., 2em\nlower. This means that clearance must be introduced. Accordingly, the\nmargins no longer collapse and the amount of clearance is set so that\nclearance + margin-top = 2em, i.e., clearance = 2em - margin-top = 2em\n- 3em = -1em.\n\nWhen the property is set on floating elements, it results in a\nmodification of the [rules](#float-rules) for\npositioning the float. An extra constraint (#10) is added:\n\nThe top [outer edge](box.html#outer-edge) \nof the float must be below the bottom outer\nedge of all earlier left-floating boxes (in the case of 'clear:\nleft'), or all earlier right-floating boxes (in the case of 'clear:\nright'), or both ('clear: both').\n\nNote.\nThis property [applied to all elements in CSS1](https://www.w3.org/TR/REC-CSS1/#clear). Implementations \nmay therefore have supported this property on all elements. In CSS2 \nand CSS 2.2 the 'clear' property only applies to block-level elements. \nTherefore authors should only use this property on block-level\nelements. If an implementation does support clear on inline elements, \nrather than setting a clearance as explained above, \nthe implementation should force a break and effectively insert one or more empty line boxes (or shifting the new line box downward as described in [section 9.5](#floats)) to move the top of the cleared inline's line box to below the respective floating box(es).",
      "rawLength": 7835
    },
    "absolute-positioning": {
      "id": "absolute-positioning",
      "heading": "9.6 Absolute positioning",
      "content": "In the absolute positioning model, a box is explicitly offset with\nrespect to its containing block. It is removed from the normal flow\nentirely (it has no impact on later siblings). An absolutely\npositioned box establishes a new containing block for normal flow\nchildren and absolutely (but not fixed) positioned descendants. However, the contents of an\nabsolutely positioned element do not flow around any other boxes. They\nmay obscure the contents of another box (or be obscured themselves), \ndepending on the\n[stack levels](#stack-level) of the overlapping boxes.\n\nReferences in this specification to an \n**absolutely positioned\nelement** (or its box) imply that the element's ['position'](visuren.html#propdef-position) property has the value\n'absolute' or 'fixed'.",
      "rawLength": 978
    },
    "fixed-positioning": {
      "id": "fixed-positioning",
      "heading": "9.6.1 Fixed positioning",
      "content": "Fixed positioning is a subcategory of absolute positioning. The\nonly difference is that for a fixed positioned box, the containing\nblock is established by the [viewport](#viewport). For [continuous media](media.html#continuous-media-group), fixed\nboxes do not move when the document is scrolled. In this respect, they\nare similar to [fixed\nbackground images](colors.html#background-properties). For [paged media](page.html), boxes\nwith fixed positions are repeated on every page. This is useful for\nplacing, for instance, a signature at the bottom of each page.\nBoxes with fixed position that are larger than the page area are\nclipped. Parts of the fixed position box that are not visible in the\ninitial containing block will not print.\n\nAuthors may use fixed positioning to create frame-like presentations.\nConsider the following frame layout:\n\n [[D]](images/longdesc/frame-desc.html)\n\nThis might be achieved with the following HTML document and\nstyle rules:\n\n```\n\n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01//EN\">\n<HTML>\n <HEAD>\n <TITLE>A frame document with CSS</TITLE>\n <STYLE type=\"text/css\" media=\"screen\">\n BODY { height: 8.5in } /* Required for percentage heights below */\n #header {\n position: fixed;\n width: 100%;\n height: 15%;\n top: 0;\n right: 0;\n bottom: auto;\n left: 0;\n }\n #sidebar {\n position: fixed;\n width: 10em;\n height: auto;\n top: 15%;\n right: auto;\n bottom: 100px;\n left: 0;\n }\n #main {\n position: fixed;\n width: auto;\n height: auto;\n top: 15%;\n right: 0;\n bottom: 100px;\n left: 10em;\n }\n #footer {\n position: fixed;\n width: 100%;\n height: 100px;\n top: auto;\n right: 0;\n bottom: 0;\n left: 0;\n }\n </STYLE>\n </HEAD>\n <BODY>\n <DIV id=\"header\"> ... </DIV>\n <DIV id=\"sidebar\"> ... </DIV>\n <DIV id=\"main\"> ... </DIV>\n <DIV id=\"footer\"> ... </DIV>\n </BODY>\n</HTML>\n\n```",
      "rawLength": 2562
    },
    "dis-pos-flo": {
      "id": "dis-pos-flo",
      "heading": "9.7 Relationships between 'display', 'position', and 'float'",
      "content": "The three properties that affect box generation and layout — \n['display'](visuren.html#propdef-display), \n['position'](visuren.html#propdef-position), and \n['float'](visuren.html#propdef-float) — interact as follows:\n\n- If ['display'](visuren.html#propdef-display)\nhas the value 'none', then \n['position'](visuren.html#propdef-position) and\n['float'](visuren.html#propdef-float) do not apply. \nIn this case, the element generates no box.\n\n- Otherwise, if ['position'](visuren.html#propdef-position)\nhas the value 'absolute' or 'fixed', the box is absolutely positioned, \nthe computed\nvalue of ['float'](visuren.html#propdef-float) is 'none', \nand display is set according to the table below. \nThe position of the box will be determined by the ['top'](visuren.html#propdef-top), ['right'](visuren.html#propdef-right), ['bottom'](visuren.html#propdef-bottom) and ['left'](visuren.html#propdef-left) properties and the box's \ncontaining block.\n\n- Otherwise, if 'float' has a value other than 'none', the box is\nfloated and 'display' is set according to the table below.\n\n- Otherwise, if the element is the root element, \n'display' is set according to the table below, except that it is\nundefined in CSS 2.2 whether a specified value of 'list-item'\nbecomes a computed value of 'block' or 'list-item'.\n\n- Otherwise, the remaining ['display'](visuren.html#propdef-display) property values apply\nas specified.\n\nSpecified value Computed value\ninline-table table\ninline, table-row-group, table-column,\ntable-column-group, table-header-group, table-footer-group, table-row,\ntable-cell, table-caption, inline-block block\nothers same as specified",
      "rawLength": 2686
    },
    "comparison": {
      "id": "comparison",
      "heading": "9.8 Comparison of normal flow, floats, and absolute positioning",
      "content": "To illustrate the differences between normal flow, relative\npositioning, floats, and absolute positioning, we provide a series of\nexamples based on the following HTML:\n\n```\n\n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01//EN\">\n<HTML>\n <HEAD>\n <TITLE>Comparison of positioning schemes</TITLE>\n </HEAD>\n <BODY>\n <P>Beginning of body contents.\n <SPAN id=\"outer\"> Start of outer contents.\n <SPAN id=\"inner\"> Inner contents.</SPAN>\n End of outer contents.</SPAN>\n End of body contents.\n </P>\n </BODY>\n</HTML>\n\n```\n\nIn this document, we assume the following rules:\n\n```\n\nbody { display: block; font-size:12px; line-height: 200%; \n width: 400px; height: 400px }\np { display: block }\nspan { display: inline }\n\n```\n\nThe final positions of boxes generated by the outer and\ninner elements vary in each example. In each illustration,\nthe numbers to the left of the illustration indicate the [normal flow](#normal-flow) position of the double-spaced (for\nclarity) lines. \n\nNote. The diagrams in this section are illustrative and not to \nscale. They are meant to highlight the differences between the \nvarious positioning schemes in CSS 2.2, and are not intended to be \nreference renderings of the examples given.",
      "rawLength": 1498
    },
    "comp-normal-flow": {
      "id": "comp-normal-flow",
      "heading": "9.8.1 Normal flow",
      "content": "Consider the following CSS declarations for outer and\ninner that do not alter the [normal\nflow](#normal-flow) of boxes:\n\n```\n\n#outer { color: red }\n#inner { color: blue }\n\n```\n\nThe P element contains all inline content: [anonymous inline text](#anonymous) and two SPAN\nelements. Therefore, all of the content will be laid out\nin an inline formatting context, within a containing block\nestablished by the P element, producing something like:\n\n [[D]](images/longdesc/flow-generic-desc.html)",
      "rawLength": 878
    },
    "comp-relpos": {
      "id": "comp-relpos",
      "heading": "9.8.2 Relative positioning",
      "content": "To see the effect of [relative\npositioning](#relative-positioning), we specify:\n\n```\n\n#outer { position: relative; top: -12px; color: red }\n#inner { position: relative; top: 12px; color: blue }\n\n```\n\nText flows normally up to the outer element. The\nouter text is then flowed into its normal flow position and\ndimensions at the end of line 1. Then, the inline boxes containing the\ntext (distributed over three lines) are shifted as a unit by '-12px'\n(upwards).\n\nThe contents of inner, as a child of outer, would\nnormally flow immediately after the words \"of outer contents\" (on line\n1.5). However, the inner contents are themselves offset\nrelative to the outer contents by '12px' (downwards), back to\ntheir original position on line 2.\n\nNote that the content following outer is not affected by the\nrelative positioning of outer.\n\n [[D]](images/longdesc/flow-relative-desc.html)\n\nNote also that had the offset of outer been '-24px', the\ntext of outer and the body text would have overlapped.",
      "rawLength": 1467
    },
    "comp-float": {
      "id": "comp-float",
      "heading": "9.8.3 Floating a box",
      "content": "Now consider the effect of [floating](#floats) the\ninner element's text to the right by means of the following\nrules:\n\n```\n\n#outer { color: red }\n#inner { float: right; width: 130px; color: blue }\n\n```\n\nText flows normally up to the inner box, which is pulled\nout of the flow and floated to the right margin (its ['width'](visudet.html#propdef-width) has been assigned explicitly).\nLine boxes to the left of the float are shortened, and the \ndocument's remaining text flows into them.\n\n [[D]](images/longdesc/flow-float-desc.html)\n\nTo show the effect of the ['clear'](visuren.html#propdef-clear) property, we add a sibling\nelement to the example:\n\n```\n\n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01//EN\">\n<HTML>\n <HEAD>\n <TITLE>Comparison of positioning schemes II</TITLE>\n </HEAD>\n <BODY>\n <P>Beginning of body contents.\n <SPAN id=outer> Start of outer contents.\n <SPAN id=inner> Inner contents.</SPAN>\n <SPAN id=sibling> Sibling contents.</SPAN>\n End of outer contents.</SPAN>\n End of body contents.\n </P>\n </BODY>\n</HTML>\n\n```\n\nThe following rules:\n\n```\n\n#inner { float: right; width: 130px; color: blue }\n#sibling { color: red }\n\n```\n\ncause the inner box to float to the right as before and the\ndocument's remaining text to flow into the vacated space:\n\n [[D]](images/longdesc/flow-clear-desc.html)\n\nHowever, if the ['clear'](visuren.html#propdef-clear)\nproperty on the sibling element is set to 'right' (i.e., the\ngenerated sibling box will not accept a position next to\nfloating boxes to its right), the sibling content begins to\nflow below the float:\n\n```\n\n#inner { float: right; width: 130px; color: blue }\n#sibling { clear: right; color: red }\n\n```\n\n [[D]](images/longdesc/flow-clear2-desc.html)",
      "rawLength": 3314
    },
    "comp-abspos": {
      "id": "comp-abspos",
      "heading": "9.8.4 Absolute positioning",
      "content": "Finally, we consider the effect of [absolute positioning](#absolute-positioning).\nConsider the following CSS declarations for outer and\ninner:\n\n```\n\n#outer { \n position: absolute; \n top: 200px; left: 200px; \n width: 200px; \n color: red;\n}\n#inner { color: blue }\n\n```\n\nwhich cause the top of the outer box to be positioned with\nrespect to its containing block. The containing block for a positioned\nbox is established by the nearest positioned ancestor (or, if none\nexists, the [initial containing\nblock](visudet.html#containing-block-details), as in our example). The top side of the outer box\nis '200px' below the top of the containing block and the left side is\n'200px' from the left side. The child box of outer is flowed\nnormally with respect to its parent.\n\n [[D]](images/longdesc/flow-absolute-desc.html)\n\nThe following example shows an absolutely positioned box that is a\nchild of a relatively positioned box. Although the parent\nouter box is not actually offset, setting its ['position'](visuren.html#propdef-position) property to 'relative'\nmeans that its box may serve as the containing block for positioned\ndescendants. Since the outer box is an inline box that is\nsplit across several lines, the first inline box's top and left edges\n(depicted by thick dashed lines in the illustration below)\nserve as references for ['top'](visuren.html#propdef-top) and\n['left'](visuren.html#propdef-left) offsets.\n\n```\n\n#outer { \n position: relative; \n color: red \n}\n#inner { \n position: absolute; \n top: 200px; left: -100px; \n height: 130px; width: 130px; \n color: blue;\n}\n\n```\n\nThis results in something like the following:\n\n [[D]](images/longdesc/flow-abs-rel-desc.html)\n\nIf we do not position the outer box:\n\n```\n\n#outer { color: red }\n#inner {\n position: absolute; \n top: 200px; left: -100px; \n height: 130px; width: 130px; \n color: blue;\n}\n\n```\n\nthe containing block for inner becomes the [initial containing block](visudet.html#containing-block-details) (in our\nexample). The following illustration shows where the inner\nbox would end up in this case.\n\n [[D]](images/longdesc/flow-static-desc.html)\n\nRelative and absolute positioning may be used to implement change\nbars, as shown in the following example. The following fragment:\n\n```\n\n<P style=\"position: relative; margin-right: 10px; left: 10px;\">\nI used two red hyphens to serve as a change bar. They\nwill \"float\" to the left of the line containing THIS\n<SPAN style=\"position: absolute; top: auto; left: -1em; color: red;\">--</SPAN>\nword.</P>\n\n```\n\nmight result in something like:\n\n [[D]](images/longdesc/changebar-desc.html)\n\nFirst, the paragraph (whose containing block sides are shown in the\nillustration) is flowed normally. Then it is offset '10px' from the\nleft edge of the containing block (thus, a right margin of '10px' has\nbeen reserved in anticipation of the offset). The two hyphens acting\nas change bars are taken out of the flow and positioned at the current\nline (due to 'top: auto'), '-1em' from the left edge of its containing\nblock (established by the P in its final position). The result is\nthat the change bars seem to \"float\" to the left of the current\nline.",
      "rawLength": 5124
    },
    "direction": {
      "id": "direction",
      "heading": "9.10 Text direction: the 'direction' and 'unicode-bidi' properties",
      "content": "[Conforming](conform.html#conformance) user agents that do\nnot support bidirectional text may ignore the ['direction'](visuren.html#propdef-direction) and ['unicode-bidi'](visuren.html#propdef-unicode-bidi) properties\ndescribed in this section. This exception includes UAs that render\nright-to-left characters simply because a font on the system contains them\nbut do not support the concept of right-to-left text direction.\n\nThe characters in certain scripts are written from right to\nleft. In some documents, in particular those written with the Arabic\nor Hebrew script, and in some mixed-language contexts, text in a\nsingle (visually displayed) block may appear with mixed\ndirectionality. This phenomenon is called **bidirectionality**, or\n\"bidi\" for short.\n\nThe Unicode standard ([[UNICODE]](refs.html#ref-UNICODE), [[UAX9]](refs.html#ref-UAX9)) defines a complex\nalgorithm for determining the proper directionality of text. The\nalgorithm consists of an implicit part based on character properties,\nas well as explicit controls for embeddings and overrides. CSS 2.2 relies\non this algorithm to achieve proper bidirectional rendering. The ['direction'](visuren.html#propdef-direction) and ['unicode-bidi'](visuren.html#propdef-unicode-bidi) properties allow\nauthors to specify how the elements and attributes of a document\nlanguage map to this algorithm.\n\nUser agents that support bidirectional text must apply the Unicode\nbidirectional algorithm to every sequence of inline-level boxes uninterrupted\nby a forced ([bidi\nclass B](http://www.unicode.org/reports/tr9/#Bidirectional_Character_Types)) break or block boundary. This sequence forms the\n\"paragraph\" unit in the bidirectional algorithm. The paragraph embedding\nlevel is set according to the value of the ['direction'](visuren.html#propdef-direction) property of the containing\nblock rather than by the heuristic given in steps P2 and P3 of the Unicode\nalgorithm.\n\nBecause the directionality of a text depends on the structure and\nsemantics of the document language, these properties should in most\ncases be used only by designers of document type descriptions (DTDs),\nor authors of special documents. If a default style sheet specifies\nthese properties, authors and users should not specify rules to\noverride them. \n\nThe HTML 4 specification ([HTML4], section 8.2) defines\nbidirectionality behavior for HTML elements. The style sheet\nrules that would achieve the bidi behavior specified in [[HTML4]](refs.html#ref-HTML4) are\ngiven in [the sample style sheet](sample.html#bidi). The\nHTML 4 specification also contains more information on\nbidirectionality issues.\n\n \n \n Name:\n **direction**Value:ltr | rtl | [inherit](cascade.html#value-def-inherit)\nInitial:ltr\nApplies to:all elements, but see prose\nInherited:yes\nPercentages:N/A\nMedia:[visual](media.html#visual-media-group)\nComputed value:as specified\n\nThis property specifies the base writing direction of blocks and\nthe direction of embeddings and overrides (see ['unicode-bidi'](visuren.html#propdef-unicode-bidi)) for the Unicode\nbidirectional algorithm. In addition, it specifies such things as the\ndirection of [table](tables.html) column layout, the direction of\nhorizontal [overflow](visufx.html#overflow), the\nposition of an incomplete last line in a block in case of 'text-align:\njustify'.\n\nValues for this property have the following meanings:\n\nltr\nLeft-to-right direction.\nrtl\n Right-to-left direction.\n\nFor the ['direction'](visuren.html#propdef-direction)\nproperty to affect reordering in inline elements, the ['unicode-bidi'](visuren.html#propdef-unicode-bidi) property's value\nmust be 'embed' or 'override'.\n\nNote. \nThe ['direction'](visuren.html#propdef-direction) property, when\nspecified for table column elements, is not inherited by cells in the\ncolumn since columns are not the ancestors of the cells in the document tree. \nThus, CSS cannot easily capture the \"dir\" attribute inheritance rules described\nin [[HTML4]](refs.html#ref-HTML4), section 11.3.2.1.\n\n \n \n Name:\n **unicode-bidi**Value:normal | embed | bidi-override | [inherit](cascade.html#value-def-inherit)\nInitial:normal\nApplies to:all elements, but see prose\nInherited:no\nPercentages:N/A\nMedia:[visual](media.html#visual-media-group)\nComputed value:as specified\n\nValues for this property have the following meanings:\n\nnormal\nThe element does not open an additional level of embedding with\nrespect to the bidirectional algorithm. For inline elements,\nimplicit reordering works across element boundaries.\n\nembed\n\nIf the element is inline, this value\nopens an additional level of embedding with respect to the\nbidirectional algorithm. The direction of this embedding level is\ngiven by the ['direction'](visuren.html#propdef-direction)\nproperty. Inside the element, reordering is done implicitly. This\ncorresponds to adding a LRE (U+202A; for 'direction: ltr') or RLE\n(U+202B; for 'direction: rtl') at the start of the element and a PDF\n(U+202C) at the end of the element.\n\nbidi-override\n\nFor inline elements this creates an override.\nFor block container elements \nthis creates an override for inline-level descendants not within \nanother block container\nelement.\nThis means that inside the element, reordering is strictly in sequence\naccording to the ['direction'](visuren.html#propdef-direction)\nproperty; the implicit part of the bidirectional algorithm is\nignored. This corresponds to adding a LRO (U+202D; for 'direction:\nltr') or RLO (U+202E; for 'direction: rtl') at the start of the\nelement or at the start of each anonymous child block box, if any, and\na PDF (U+202C) at the end of the element.\n\nThe final order of characters in each block container is the\nsame as if the bidi control codes had been added as described above,\nmarkup had been stripped, and the resulting character sequence had\nbeen passed to an implementation of the Unicode bidirectional\nalgorithm for plain text that produced the same line-breaks as the\nstyled text.\nIn this process, replaced elements with 'display: inline'\nare treated as\nneutral characters, unless their ['unicode-bidi'](visuren.html#propdef-unicode-bidi) property has a\nvalue other than 'normal', in which case they are treated as strong\ncharacters in the ['direction'](visuren.html#propdef-direction)\nspecified for the element.\nAll other atomic inline-level boxes are treated as neutral characters\nalways.\n\nPlease note that in order to be able to flow inline boxes in a\nuniform direction (either entirely left-to-right or entirely\nright-to-left), more inline boxes (including anonymous inline boxes)\nmay have to be created, and some inline boxes may have to be split up\nand reordered before flowing.\n\nBecause the Unicode algorithm has a limit of \n61 levels of\nembedding, care should be taken not to use ['unicode-bidi'](visuren.html#propdef-unicode-bidi) with a value other\nthan 'normal' unless appropriate. In particular, a value of 'inherit'\nshould be used with extreme caution. However, for elements that are,\nin general, intended to be displayed as blocks, a setting of\n'unicode-bidi: embed' is preferred to keep the element together in\ncase display is changed to inline (see example below).\n\nThe following example shows an XML document with bidirectional\ntext. It illustrates an important design principle: DTD designers should take bidi\ninto account both in the language proper (elements and attributes) and\nin any accompanying style sheets. The style sheets should be designed\nso that bidi rules are separate from other style rules. The bidi rules\nshould not be overridden by other style sheets so that the document\nlanguage's or DTD's bidi behavior is preserved.\n\nExample(s):\n\nIn this example, \nlowercase letters stand for inherently left-to-right characters and\nuppercase letters represent inherently right-to-left characters:\n\n```\n\n<HEBREW>\n <PAR>HEBREW1 HEBREW2 english3 HEBREW4 HEBREW5</PAR>\n <PAR>HEBREW6 <EMPH>HEBREW7</EMPH> HEBREW8</PAR>\n</HEBREW>\n<ENGLISH>\n <PAR>english9 english10 english11 HEBREW12 HEBREW13</PAR>\n <PAR>english14 english15 english16</PAR>\n <PAR>english17 <HE-QUO>HEBREW18 english19 HEBREW20</HE-QUO></PAR>\n</ENGLISH>\n\n```\n\nSince this is XML, the style sheet is responsible for setting the\nwriting direction. This is the style sheet:\n\n```\n\n/* Rules for bidi */\nHEBREW, HE-QUO {direction: rtl; unicode-bidi: embed}\nENGLISH {direction: ltr; unicode-bidi: embed} \n\n/* Rules for presentation */\nHEBREW, ENGLISH, PAR {display: block}\nEMPH {font-weight: bold}\n\n```\n\nThe HEBREW element is a block with a right-to-left base direction,\nthe ENGLISH element is a block with a left-to-right base\ndirection. The PARs are blocks that inherit the base direction from\ntheir parents. Thus, the first two PARs are read starting at the top\nright, the final three are read starting at the top left. Please note\nthat HEBREW and ENGLISH are chosen as element names for explicitness\nonly; in general, element names should convey structure without\nreference to language.\n\nThe EMPH element is inline-level, and since its value for ['unicode-bidi'](visuren.html#propdef-unicode-bidi) is 'normal' (the\ninitial value), it has no effect on the ordering of the text. The\nHE-QUO element, on the other hand, creates an embedding.\n\nThe formatting of this text might look like this if the line length\nis long:\n\n```\n\n 5WERBEH 4WERBEH english3 2WERBEH 1WERBEH\n\n 8WERBEH 7WERBEH 6WERBEH\n\nenglish9 english10 english11 13WERBEH 12WERBEH\n\nenglish14 english15 english16\n\nenglish17 20WERBEH english19 18WERBEH\n\n```\n\nNote that the HE-QUO embedding causes HEBREW18 to be to the right\nof english19.\n\nIf lines have to be broken, it might be more like this:\n\n```\n\n 2WERBEH 1WERBEH\n -EH 4WERBEH english3\n 5WERB\n\n -EH 7WERBEH 6WERBEH\n 8WERB\n\nenglish9 english10 en-\nglish11 12WERBEH\n13WERBEH\n\nenglish14 english15\nenglish16\n\nenglish17 18WERBEH\n20WERBEH english19\n\n```\n\nBecause HEBREW18 must be read before english19, it is on the line\nabove english19. Just breaking the long line from the earlier\nformatting would not have worked. Note also that the first syllable\nfrom english19 might have fit on the previous line, but hyphenation of\nleft-to-right words in a right-to-left context, and vice versa, is\nusually suppressed to avoid having to display a hyphen in the middle\nof a line.\n\n[previous](box.html) \n[next](visudet.html) \n[contents](Overview.html#minitoc) \n[properties](propidx.html) \n[index](indexlist.html)",
      "rawLength": 13664
    }
  }
}