{
  "specName": "css22-ch2",
  "extractedAt": "2026-02-06T08:54:13.737Z",
  "totalSections": 6,
  "coreSections": 6,
  "sections": {
    "html-tutorial": {
      "id": "html-tutorial",
      "heading": "2.1 A brief CSS&nbsp;2.2 tutorial for HTML",
      "content": "This section is non-normative.\n\n In this tutorial, we show how easy it can be to design simple\nstyle sheets. For this tutorial, you will need to know a little HTML\n(see [[HTML4]](refs.html#ref-HTML4)) and some basic desktop publishing terminology.\n\nWe begin with a small HTML document:\n\n```\n\n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01//EN\">\n<HTML>\n <HEAD>\n <TITLE>Bach's home page</TITLE>\n </HEAD>\n <BODY>\n <H1>Bach's home page</H1>\n <P>Johann Sebastian Bach was a prolific composer.\n </BODY>\n</HTML>\n\n```\n\nTo set the text color of the H1 elements to red, you can write the\nfollowing CSS rules:\n\n```\n\n h1 { color: red }\n\n```\n\nA CSS rule consists of two main parts: [selector](selector.html) ('h1') and declaration\n('color: red'). In HTML, element names are case-insensitive so\n'h1' works just as well as 'H1'. The declaration has two parts:\nproperty name ('color') and property value ('red'). While the example above tries to\ninfluence only one of the properties needed for rendering an HTML\ndocument, it qualifies as a style sheet on its own. Combined with\nother style sheets (one fundamental feature of CSS is that style\nsheets are combined), the rule will determine the final presentation of the\ndocument.\n\n The HTML 4 specification defines how style sheet rules may be\nspecified for HTML documents: either within the HTML document, or via\nan external style sheet. To put the style sheet into the document, use\nthe STYLE element:\n\n```\n\n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01//EN\">\n<HTML>\n <HEAD>\n <TITLE>Bach's home page</TITLE>\n <STYLE type=\"text/css\">\n h1 { color: red }\n </STYLE>\n </HEAD>\n <BODY>\n <H1>Bach's home page</H1>\n <P>Johann Sebastian Bach was a prolific composer.\n </BODY>\n</HTML>\n\n```\n\n For maximum flexibility, we recommend that authors specify\nexternal style sheets; they may be changed without modifying the\nsource HTML document, and they may be shared among several\ndocuments. To link to an external style sheet, you can use the LINK\nelement:\n\n```\n\n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01//EN\">\n<HTML>\n <HEAD>\n <TITLE>Bach's home page</TITLE>\n <LINK rel=\"stylesheet\" href=\"bach.css\" type=\"text/css\">\n </HEAD>\n <BODY>\n <H1>Bach's home page</H1>\n <P>Johann Sebastian Bach was a prolific composer.\n </BODY>\n</HTML>\n\n```\n\nThe LINK element specifies:\n\nthe type of link: to a \"stylesheet\".\nthe location of the style sheet via the \"href\" attribute. \nthe type of style sheet being linked: \"text/css\".\n\nTo show the close relationship between a style sheet and the\nstructured markup, we continue to use the STYLE element in this\ntutorial. Let's add more colors:\n\n```\n\n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01//EN\">\n<HTML>\n <HEAD>\n <TITLE>Bach's home page</TITLE>\n <STYLE type=\"text/css\">\n body { color: black; background: white }\n h1 { color: red; background: white }\n </STYLE>\n </HEAD>\n <BODY>\n <H1>Bach's home page</H1>\n <P>Johann Sebastian Bach was a prolific composer.\n </BODY>\n</HTML>\n\n```\n\nThe style sheet now contains four rules: the first two set the\ncolor and background of the BODY element (it's a good idea to set the\ntext color and background color together), while the last two\nset the color and the background of the H1 element. Since no color\nhas been specified for the P element, it will inherit the color\nfrom its parent element, namely BODY. The H1 element is also a child\nelement of BODY but the second rule overrides the inherited value. In\nCSS there are often such conflicts between different values, and this\nspecification describes how to resolve them.\n\nCSS 2.2 has more than 90 properties, including ['color'](colors.html#propdef-color). Let's look at some of the\nothers:\n\n```\n\n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01//EN\">\n<HTML>\n <HEAD>\n <TITLE>Bach's home page</TITLE>\n <STYLE type=\"text/css\">\n body { \n font-family: \"Gill Sans\", sans-serif;\n font-size: 12pt;\n margin: 3em; \n }\n </STYLE>\n </HEAD>\n <BODY>\n <H1>Bach's home page</H1>\n <P>Johann Sebastian Bach was a prolific composer.\n </BODY>\n</HTML>\n\n```\n\nThe first thing to notice is that several declarations are grouped\nwithin a block enclosed by curly braces ({...}), and separated by\nsemicolons, though the last declaration may also be followed by a\nsemicolon.\n\nThe first declaration on the BODY element sets the font family to\n\"Gill Sans\". If that font is not available, the user agent (often\nreferred to as a \"browser\") will use the 'sans-serif' font family\nwhich is one of five generic font families which all users agents\nknow. Child elements of BODY will inherit the value of the ['font-family'](fonts.html#propdef-font-family) property.\n\nThe second declaration sets the font size of the BODY element to\n12 points. The \"point\" unit is commonly used in print-based typography\nto indicate font sizes and other length values. It's an example of an\nabsolute unit which does not scale relative to the environment. \n\nThe third declaration uses a relative unit which scales with regard\nto its surroundings. The \"em\" unit refers to the font size of the\nelement. In this case the result is that the margins around the BODY\nelement are three times wider than the font size.",
      "rawLength": 6031
    },
    "xml-tutorial": {
      "id": "xml-tutorial",
      "heading": "2.2 A brief CSS&nbsp;2.2 tutorial for XML",
      "content": "This section is non-normative.\n\nCSS can be used with any structured document format, for example\nwith applications of the eXtensible Markup Language [[XML11]](refs.html#ref-XML11). In\nfact, XML depends more on style sheets than HTML, since authors can\nmake up their own elements that user agents do not know how to\ndisplay.\n\nHere is a simple XML fragment:\n\n```\n\n<ARTICLE>\n <HEADLINE>Fredrick the Great meets Bach</HEADLINE>\n <AUTHOR>Johann Nikolaus Forkel</AUTHOR>\n <PARA>\n One evening, just as he was getting his \n <INSTRUMENT>flute</INSTRUMENT> ready and his\n musicians were assembled, an officer brought him a list of\n the strangers who had arrived.\n </PARA>\n</ARTICLE>\n\n```\n\nTo display this fragment in a document-like fashion, we must first\ndeclare which elements are inline-level (i.e., do not cause line breaks) and\nwhich are block-level (i.e., cause line breaks). \n\n```\n\nINSTRUMENT { display: inline }\nARTICLE, HEADLINE, AUTHOR, PARA { display: block }\n\n```\n\nThe first rule declares INSTRUMENT to be inline and the second\nrule, with its comma-separated list of selectors, declares all the\nother elements to be block-level. Element names in XML are\ncase-sensitive, so a selector written in lowercase (e.g., 'instrument')\nis different from uppercase (e.g., 'INSTRUMENT').\n\nOne way of linking a style sheet to an XML document is to use\na processing instruction:\n\n```\n\n<?xml-stylesheet type=\"text/css\" href=\"bach.css\"?>\n<ARTICLE>\n <HEADLINE>Fredrick the Great meets Bach</HEADLINE>\n <AUTHOR>Johann Nikolaus Forkel</AUTHOR>\n <PARA>\n One evening, just as he was getting his \n <INSTRUMENT>flute</INSTRUMENT> ready and his\n musicians were assembled, an officer brought him a list of\n the strangers who had arrived.\n </PARA>\n</ARTICLE>\n\n```\n\nA visual user agent could format the above example as:\n\n [[D]](images/longdesc/bach1-desc.html)\n\nNotice that the word \"flute\" remains within the paragraph since it\nis the content of the inline element INSTRUMENT.\n\nStill, the text is not formatted the way you would expect. For\nexample, the headline font size should be larger than then the rest of\nthe text, and you may want to display the author's name in italic:\n\n```\n\nINSTRUMENT { display: inline }\nARTICLE, HEADLINE, AUTHOR, PARA { display: block }\nHEADLINE { font-size: 1.3em }\nAUTHOR { font-style: italic }\nARTICLE, HEADLINE, AUTHOR, PARA { margin: 0.5em }\n\n```\n\nA visual user agent could format the above example as:\n\n [[D]](images/longdesc/bach2-desc.html)\n\nAdding more rules to the style sheet will allow you to further\ndescribe the presentation of the document.",
      "rawLength": 3367
    },
    "processing-model": {
      "id": "processing-model",
      "heading": "2.3 The CSS&nbsp;2.2 processing model",
      "content": "This section up to but not including its subsections is\nnon-normative.\n\nThis section presents one possible model of how user\nagents that support CSS work. This is only a conceptual model; real\nimplementations may vary.\n\nIn this model, a user agent processes a source\nby going through the following steps:\n\n- Parse the source document and create a [document tree](conform.html#doctree).\n\nIdentify the target [media type](media.html).\n\nRetrieve all style sheets associated with the document that are\nspecified for the target [media type](media.html).\n\nAnnotate every element of the document tree by assigning a single\nvalue to every [property](syndata.html#properties) that is\napplicable to the target [media type](media.html).\nProperties are assigned values according to the mechanisms described\nin the section on [cascading and\ninheritance](cascade.html). \n\nPart of the calculation of values depends on the formatting\nalgorithm appropriate for the target [media\ntype](media.html). For example, if the target medium is the screen, user agents\napply the [visual formatting model](visuren.html). \n\nFrom the annotated document tree, generate a \n\n**formatting\nstructure**. Often, the formatting structure closely\nresembles the document tree, but it may also differ significantly,\nnotably when authors make use of pseudo-elements and generated content.\nFirst, the formatting structure need not be \"tree-shaped\" at all -- the\nnature of the structure depends on the implementation. Second, the\nformatting structure may contain more or less information than the\ndocument tree. For instance, if an element in the document tree has a\nvalue of 'none' for the ['display'](visuren.html#propdef-display) property, that element will\ngenerate nothing in the formatting structure. A list element, on the\nother hand, may generate more information in the formatting structure:\nthe list element's content and list style information (e.g., a bullet\nimage).\n\nNote that the CSS user agent does not alter the document tree\nduring this phase. In particular, content generated due to style\nsheets is not fed back to the document language processor (e.g., for\nreparsing).\n\nTransfer the formatting structure to the target medium (e.g., print\nthe results, display them on the screen, render them as speech,\netc.).",
      "rawLength": 2601
    },
    "the-canvas": {
      "id": "the-canvas",
      "heading": "2.3.1 The canvas",
      "content": "For all media, the term **canvas** describes \"the space where\nthe formatting structure is rendered.\" The canvas is infinite for each\ndimension of the space, but rendering generally occurs within\na finite region of the canvas, established by the user agent\naccording to the target medium. For instance, user agents rendering\nto a screen generally impose a minimum width and choose an initial\nwidth based on the dimensions of the [\nviewport](visuren.html#viewport). User agents rendering to a page generally impose\nwidth and height constraints. Aural user agents may impose limits\nin audio space, but not in time.",
      "rawLength": 706
    },
    "addressing": {
      "id": "addressing",
      "heading": "2.3.2 CSS&nbsp;2.2 addressing model",
      "content": "CSS 2.2 [selectors](selector.html) and properties allow\nstyle sheets to refer to the following parts of a document\nor user agent:\n\nElements in the document tree and certain relationships between\nthem (see the section on [selectors](selector.html)).\n\nAttributes of elements in the document tree, and values of those\nattributes (see the section on [attribute selectors](selector.html#attribute-selectors)).\n\nSome parts of element content (see the [:first-line](selector.html#first-line) and [:first-letter](selector.html#first-letter) pseudo-elements).\n\nElements of the document tree when they are in a certain state\n(see the section on [pseudo-classes](selector.html#pseudo-classes)).\n\nSome aspects of the [canvas](#canvas) where\nthe document will be rendered.\n\nSome system information (see the section on [user\ninterface](ui.html)).",
      "rawLength": 972
    },
    "design-principles": {
      "id": "design-principles",
      "heading": "2.4 CSS design principles",
      "content": "This section is non-normative.\n\nCSS 2.2, as CSS2 and CSS1 before it, is based on a set of design principles:\n\n- \n\nForward and backward compatibility. CSS 2.2 user\nagents will be able to understand CSS1 style sheets. CSS1 user agents\nwill be able to read CSS 2.2 style sheets and discard parts they do not\nunderstand. Also, user agents with no CSS support will be able to\ndisplay style-enhanced documents. Of course, the stylistic\nenhancements made possible by CSS will not be rendered, but all\ncontent will be presented.\n\n- \n\nComplementary to structured documents. Style\nsheets complement structured documents (e.g., HTML and XML\napplications), providing\nstylistic information for the marked-up text. It should be easy to\nchange the style sheet with little or no impact on the markup.\n\n- \n\nVendor, platform, and device independence. Style\nsheets enable documents to remain vendor, platform, and device\nindependent. Style sheets themselves are also vendor and platform\nindependent, but CSS 2.2 allows you to target a style sheet for a group of\ndevices (e.g., printers).\n\n- \n\nMaintainability. By pointing to style sheets from\ndocuments, webmasters can simplify site maintenance and retain\nconsistent look and feel throughout the site. For example, if\nthe organization's background color changes, only one file needs to be\nchanged.\n\n- \n\nSimplicity. CSS is a simple style language which\nis human readable and writable. The CSS properties are kept\nindependent of each other to the largest extent possible and there is\ngenerally only one way to achieve a certain effect.\n\n- \n\nNetwork performance. CSS provides for compact\nencodings of how to present content. Compared to images or audio\nfiles, which are often used by authors to achieve certain rendering\neffects, style sheets most often decrease the content size. Also,\nfewer network connections have to be opened which further increases\nnetwork performance.\n \n\n- \n\nFlexibility. CSS can be applied to content in\nseveral ways. The key feature is the ability to cascade style\ninformation specified in the default (user agent) style sheet, user\nstyle sheets, linked style sheets, the document head, and in\nattributes for the elements forming the document body.\n\n- \n\nRichness. Providing authors with a rich set of\nrendering effects increases the richness of the Web as a medium of\nexpression. Designers have been longing for functionality commonly\nfound in desktop publishing and slide-show applications. Some of\nthe requested rendering effects conflict with device independence, but\nCSS 2.2 goes a long way toward granting designers their requests.\n\n- \n\nAlternative language bindings. The set of CSS\nproperties described in this specification form a consistent\nformatting model for visual and aural presentations. This formatting\nmodel can be accessed through the CSS language, but bindings to other\nlanguages are also possible. For example, a JavaScript program may\ndynamically change the value of a certain element's ['color'](colors.html#propdef-color) property.\n\nAccessibility. Several CSS \nfeatures will make the Web more accessible \nto users with disabilities:\n\nProperties to control font appearance allow authors\nto eliminate inaccessible bit-mapped text images. \n\nPositioning properties allow authors to eliminate\nmark-up tricks (e.g., invisible images) to force layout.\n\nThe semantics of\n!important rules mean that users with \nparticular presentation requirements\ncan override the author's style sheets.\n\nThe 'inherit' value for all properties\nimproves cascading generality and allows for\neasier and more consistent style tuning.\n\nImproved media support, including media groups and the \nbraille, embossed, and tty media types, will allow users and\nauthors to tailor pages to those devices.\n\n Note. For more information\nabout designing accessible documents using CSS and HTML, see [[WCAG20]](refs.html#ref-WCAG20).\n\n[previous](about.html) \n[next](conform.html) \n[contents](Overview.html#minitoc) \n[properties](propidx.html) \n[index](indexlist.html)",
      "rawLength": 4727
    }
  }
}